[
    {
        "tool_call_id": "call_VFHaCMvC0laZD0LxjiWM9yaX",
        "output": "[CATEGORY:  Complex Sale] [SOURCEFILE:  Individual level sales strategies.txt]Chapter 15 - 10 Individual level strategies. Key questions.   If they voted today would we win?  How do we get each person's vote or live without it?  Stakeholder analysis A company can't buy from you, people in a company or an organization do. People decide on a vendor as individuals before they decide as a committee without a plan that takes our tactics to the individual stakeholder level, you may have only given a name to your plan and called it a strategy. In the US Congress. One of the most important individuals is the whip the whip job is to count the votes and persuade enough holders to secure passage of the bill at hand. If there aren't enough to win the phones too late if possible, very little happens by surprise. Although salespeople don't have the same sanction, as they should use a similar process to assess your competitive position, drive strategy and increase forecast accuracy. methodologies in the past have focused on competitive strategy only at the opportunity level, but nothing will drive strategy to win better than a clearer understanding of the decision making process at the stakeholder level. person by person on the project team whenever we call an action or strategy or tactic depends on the level from which is viewed the individual strategies and tactics by person and the opportunity level strategy by competitor will determine the six key to the complex sale the plan We must then which must then be communicated to the team and revise as new information on falls. By this time, we have already qualified the prospect and are refining our plan By analyzing each stakeholder using four of the keys, Pain, preference power and part in the process, we can arrive at the individual level strategy and tactics of your strategic plan. Example of a sales situation to illustrate these points: Reynolds is a powerful supporter of ours we have had her preference she's a decision maker and knows from her experience at a previous company that our solution solves her strategic business problem. She has pain and power and will play a major part of the decision making process. Obviously our individual plan for her is to one, support and motivate her with whatever time and resources she needs to sell for us inside as she encounters obstacles. We must equip our sponsors with the business case and solution. differentiators or preference will be perceived as cronyism, based on politics alone. Baker doesn't like us he has a negative preference for us, but his reasons are not connected to a major business problem, but based on a personal friendship with a competitor's rep. His organizational power is limited as strategy could be to to disconnect his opposition to us from the current major business pain and three, refocus the others onto the company's issues and their ability to solve them. Williamson and pigs are supporters preference of ours from the previous engagement they are vice presidents they have power but are not involved at the current evaluation. They have no part in the process. They may like us but that won't help unless they have a vote. Our plan is to show them how our solution affects their business problems for raise the pain and five encourage them to get themselves added to the evaluation team. As evaluators change the path. Both burns doesn't like his preference, but it doesn't really matter. Burns is so disliked in his own organization negative power, that nobody respects his opinion. His part is one of many recommenders and his business problem pain is nonstrategic we can afford to seven ignore him to alienate is never a strategy for anyone but we don't need to spend much time here. Leahy and Weldon prefer the other vendor les he a lot and well done a little they are both respective sea level officers. They have power and decision makers they have a part as strategy could be to try to aid change preference because if they voted Now, part of the process we would lose. We could perhaps turn an objection to an advantage clear up a misunderstanding demonstrate a better vision or proof of our solution. Link into newfound pains or expand our proposal to provide a win for them. If we can swing one of these two votes, we would win two of the three decision makers and nine out vote the other and Weldon is the one closest to the fence so our efforts may be best focused on him first. This is a good old face to face persuasion, the tactical execution of our plan. We could also enlist the help of others who have influenced over the holdouts both inside and outside the company. In fact, the strategic consulting partner who has power needs our product to make their engagement successful. They have paid and he and Weldon worked at the same accounting firm. He is a potential influencer has a part to play and that competition is not even talking to them because he isn't on the official organizational chart. If we could show him why it's in his interests, change the part and get him involved to have our product perhaps he already knows could sway Weldon who's closest to the fence and then we are 10 Borrowing influence. Note that to intentionally alienate is never a strategy. Not only is it unprofessional, it might motivate the opponent to help the competition or to sabotage the project either here or at another organization. Without individual tactics or plans or strategy in name only each of these individual strategies is a tactic of a larger flanking opportunity strategy driven by the recognition that our frontal strategy to date could not win. If the answer to the question. If they voted today who would win is not me then it's time for Plan B, which beats sitting around and waiting for the answer. As you approach the crucible of the decision. You could change the pain change the players or change the process or parts of the individuals in your favor. By the way, how many accounts have you had for months and don't know this much about them? By mapping out the relationships of power. You can navigate from person to person and leverage your investment of time. I think shorten sales cycles more than selling high. We must learn not only how to gain access to executives, but what to say when we get there.\n[CATEGORY:  Complex Sale] [SOURCEFILE:  Qualify the prospect.txt]Chapter 8 - Key 2 - qualify the prospect Key questions  Is this good business for anyone  He's this a winnable opportunity for us new line   how does it compare to the rest of my opportunities one of the keys to success in business development is picking winnable battles. But how you qualify prospect depends on how many opportunities you have and how many resources you have available. The salesperson has a full pipeline of more prospects than he or she can pursue qualifies in a much different manner than a seller at a lesser known company or a new territory just trying to get in the game period consequently there is no one mathematical process for qualifying prospects. Qualification is relative new line In addition to assessing your chances of winning other qualification questions should include (1) how does this opportunity opportunity compare with the rest of my opportunities and (2) what resources would it require? The answer is unique and different to every company and will vary from territory to territory. The new account manager with nothing going works opportunities that others walk away from. With a busy pipeline, veterans prefer to win or lose early. Moreover, since each person's territory and pipeline are quite different what is qualified for one seller may not be the best use of team selling resources for the region or the firm as a whole. Qualifying versus positive mental attitude One of the obstacles for qualifying is also one of the essentials for selling a positive mental attitude. If you don't have it you wouldn't start each day and wouldn't be in the business of selling. It is what enables sales people to start with a blank piece of paper and produce $1,000,000 quotas. It is what enables hunters to overcome obstacle and turn defeats into victories. If you look at your experience and emotionally, you'll see that the number of times miracle turnarounds happen compared to the number of times you actually pour money into losing causes tells us that maybe what is needed is less emotional process or qualification. But where is the line between qualification and quitting? Where is the line between a positive mental attitude and the rookie trait of over optimism? Some people believe that the warning signs of executive denial is a background in sales and marketing which might explain why less CEO's have a background in sales and marketing. A positive mental attitude is essential to selling but we have said hope is not a strategy. The first key qualifying question for anyone should be will this business happen for anyone at all? Experience has shown that many evaluations end with no buying activity whatsoever. When evaluation stall or failed to happen at all, one of the two things is usually missing first either there is not a business problem of creating enough magnitude or urgency or secondly the project lacks political sponsorship to see through the maze to completion. And with no pain or power the deal is not going to happen in our lifetime. The second key question becomes is this a good opportunity for us? In up to 25% of these evaluations the vendor is already informally selected before the process begins which means you are cannon fodder. Closing before the deal even starts Customers might want to keep you in the game even when you're never gonna win. Why would someone conduct competitive valuation when they already know who they want? There are many reasons and all of these reasons are political   the client may need to show due diligence  The client may not legally be allowed to sole source  the client may need to validate their decision  the client may need to educate themselves about other issues  Client may need to create buy in from a project team by letting them participate in the evaluation Make sure you're not the stalking horse in these situations if you get an unsolicited RFP on your desk and you didn't write it there is a chance that someone else did. If that's the case you are merely cannon fodder in this person's due diligence process but you may not know it until it's too late. One of the things that is effective in this situation is to be candid with the prospect. Tell them your concerns remind them that you may not have a relationship with them that the RFP has come out of the blue and that you are familiar with all the obligations they have in their situation to involve multiple vendors. But it's OK to discuss with the prospects the enormous efforts and costs that are involved in responding to RFP's. There are certain justifications you are obligated to go through with your management in order to get the managements’ commitment to helping you marshal the resources to put together a coherent response to their RFP. Ask them some pointed questions, ask them for exposure to more senior people, ask them to do certain things. Qualification is about action not words. If they are reluctant or refuse to divulge certain information or take certain actions you may take that as good reason to qualify out.   one of the indicators traditionally used by salespeople to determine the viability of the opportunity is whether the project is budgeted or not period to some salespeople this is a binary question. No budget no prospect. But if the offering is strategic enough budgets may only be an indicator. Money in the budget indicates management thought was a big enough business problem to commit funds for the coming year. The CEO and other chief officers are always planning ahead of budget and can often spend off the current budget period if there's no money in the budget to solve the business problem, that means one of two things:  firstly get high enough in the organization to someone who can spend money off the budget, or secondly sell it this year to get it in the budget for next year. In other case it's a longer sales cycle. You'll need to get higher in the organization, and the political risks are greater. But that doesn't mean you walk away from it. The most important emotional strategic issues are quite often not budgeted. They arise between budget cycles. Or opportunities that have rapid enough return on investment may pay for themselves in the current year. Or if the sponsor is powerful enough budgets may only be a guideline. The next budget question leads into politics. Whose budget is the money in question if the money is in someone's budget who opposes you, you have a problem period it's the golden rule of budgeting the ones who has the gold makes the rules. Not exactly, but they do have more power. The next issue to be examined is financial stability. Do they have the ability to pay? Money could be in the budget, but one bad quarter for manufacturing company can stop all capital purchases. A low stock price could produce an acquisition or an austerity program. Moreover, there may be other threats to the project. You may have a return on investment to justify the project, but there may not be enough cash or budget money or other priorities will prevail. Finally we live in the times of agile. This means that budgets are more fluid. Just because there is no budget or somebody says they have no budget doesn't mean that they can't create one or that you can't go find one from somebody else but you have to draw some kind of timeline on how long you're gonna try to do this and how much resource you're gonna invest. There's a key difference between the process for consultants and product sellers consultants often stimulate demand when none exists. They find business problems that have not become evaluations yet. If they qualified too hard then they wouldn't propose anything. This is why salespeople in consulting are usually more business developers than anything else. The question in this model oh firstly will the pain drive buying activity and secondly can we find a power sponsor? This is because the biggest competitor to demand creation selling is no decision or no action where the client evaluates decides that problem is not significant enough and buys nothing from anyone. Intangible qualifications there are also strategic and intangible reasons that override A logical analysis as to why you pursue a particular opportunity. It may be a brand name customer. You may want to penetrate an industry or country. You may want to prevent a competitor from getting a toehold. Or you may want to take a marginally profitable opportunity yourself to gain a toehold into the account. Another key question qualification is will the business be profitable? Unfortunately most salespeople are not measured on profitability they are measured on revenue. Consequently they don't ask this important question enough because it's not on their agenda. Finally will this business result in a satisfied client? If it doesn't you may get this piece of business and inoculate the client and the client executives from doing business with you again anywhere. Unfortunately most salespeople have measured on revenue rather than customer satisfaction and repeat results. But don't underestimate the personal impact of signing bad business on your reputation with network peers it can be career limiting. Buy another card? Account qualification isn't always a binary go or bigo. It's more like playing poker. In one type of poker we put a dollar in the pot and we get a card up and a card down. Initially we don't know much, and the first round of betting is not very expensive, perhaps 1/4. As the game proceeds someone pairs up and suddenly the price of poker goes up. It's going to cost us more to stay in this game, which must be weighed against our odds of winning. This is the way qualification should be done why in the resources in time and talent required versus our chances of winning. The earlier and tougher the qualifying is the more effective it is. Like poker eventually you will have five cards out $10 in the pot at which time you're thinking changes. Instead of focusing on the opportunity you now think about the investment you have and how you can't let that money go to waste. So you stay in until the last card but the last card doesn't cost a quarter or even a dollar. It costs $20 because there is no end to the betting and no limits. After a certain amount of investment the deal is managing you sucking up resources. In hindsight you wish you had never engaged in the first place. You must have a process for telling in advance which deals you should get in and which deals you shouldn't. If you have relative strength there's almost no deal you can't win with enough effort but at what cost and at what risk? The worst case scenario is to commit significant resources and finish second period there is no silver medals in selling and unlike race car driving there's not even any lap money for leading the race. Your qualification process must include at several points in go or no go and an option to buy another card depending on how expensive that card is we may qualify because of any of the following reasons: one we cannot solve the their pain well  two we have no access to power three the decision making process doesn't favour us for we don't have the resources for adequate pursuit five we have better opportunities elsewhere but having picked a battle we can win we need now to win the battle that we have picked by winning the hearts of the decision makers. Key 3 build competitive preference.  Without competitors there would be no need for strategy Kenichi or hammer key questions can we win? How do we win? If each person had to vote today would they recommend us? What are our differentiators? How would the competition defeat us? Preference is the degree to which a recommender or influencer from a buying committee will oppose you or help you win. How do you build it? First of all, it's important to understand the range of preferences that are possible in the complex sale. We have defined a scale of preference that runs from neutral in the middle to open and accepting to a point where individuals begin supporting you in your efforts. The key question here is if they had to vote today would they vote for us? Positive preferences rise to the level next level where they are disclosing to you information you need from their company, and its politics that will help you when the highest level of preference is trust and expressed an unexpressed feeding of whatever you're selling whereby. Negative preferences range from indifferent and skeptical to challenging your statements. To open opposition. And finally to overt hostility. You should decide if a person has too much preference for the competition for us to overcome. If they are an uncomfortable opponent, then the information we provide to try to change their preference. Maybe going straight into the hands of the competition. Positioning the art of saying it first. A psychological principle popularized by reason trout taught us that it is many times easier to help someone make up their mind in the first place than it is to change it at a certain stage baby animals imprint on the first living thing they see as its mother. The baby duck can imprint on a St. Bernard. Think of wet and hard cement the first to sculpt a vision of leadership advantage of solution in the prospects head will gain greater mindshare than the followers whose counter position themselves it's not just a matter of making a good first impression. You have to make a good first impression first. The best time to do this is obviously in the first call or in the needs assessment. So get there first. What you thought was early in the sale wasn't early enough. Benefits mapping building preference with individual is a function of fundamental selling skills personality credibility, persuasiveness, linkage and alignment the client wants to know how your capabilities and solutions will benefit them personally, as well as their organization. Building preference in opportunity is a matter of building positive mindshare, first with key influence key influences and then getting others to jump on the bandwagon as preference momentum. builds. at the account level it means delivering what was sold, making your sponsors look good and building relationships from rapport to trust. Competitive selling stay on the ethical high ground. The effective salesperson, however, can influence the issues the politics and the process without ever mentioning the competitors name. As the evaluation continues and the prospects can't differentiate, you may be able to compare your solutions quickly and openly you can discuss competitive issue depends on your relationship with the individual prospect your competitive position, the stage of the sales cycle and which region of which country you are in. In the United States comparative advertising has been around for many years, but such comparisons are illegal in other countries. Without mentioning the competition, however, you can build rapport before the competition arrives. You can suggest questions and issues that client should ask everyone you can suggest requirements of all vendors, you can stress your unique capabilities and differentiators and you can suggest steps in the evaluation cycle for all vendors. Of course the issues and steps you suggest are those that focus on your strengths and the competitors weaknesses that you have shaped the battlefield without ever mentioned. The competitor. Counter strategy. The best sales strategy is like the best pool players chess players generals look at their opportunity through their competitors eyes. If I were my competitor, how would I defeat me? This is critical thinking not negative thinking. It allows us to anticipate the competitors actions, predict them and neutralize them before they are able to execute doing this requires a victory of critical thinking over positive mental attitude. real confidence comes from a plan that has been tested and will win hope doesn't drive strategy information drive strategy controlling the point of entry. Successful hunters use many competitive tactics to establish preference by individuals and groups. The first step in establishing control of an opportunity is establishing the political point of entry many salespeople don't even tried to control the important first step. Early in sales training were taught to be responsive to the customer. When someone from a client's office calls they answer right back. The problem is the frequently a lower level project team member is assigned to gather information. One thing is for sure as soon as you contact them. They tell you I'm the decision maker you can only talk to me You are now traps. Some salespeople work hard and fast upon learning of a buying activity to see that their first point of entry is at the executive level. It is obviously easier if they are already a client or if they had used to services elsewhere. There are means of political navigation that are more effective than the direct call, which we'll discuss later. But there is a brief window early in non government accounts. While there is forgiveness and before the rules of engagement are established where you might gain access, a call to the executive to determine whether there is a viable buying activity going on often yields some very interesting results in some cases, except the executive says no, there's no buying activity going on here. Nothing is authorized. The executive just say two weeks or months of activity. Or the executive may say yes, there's some interest but the name of the person he or she gives you as the decision maker isn't the name of the person who's calling. You may have had it into a political cul de sac. Having established this channel of communication, never give it up. Always leave a good reason to call this executive back. Do you mind if I keep you apprised of how the project is going? And by the way when we do the needs assessment we'd like to spend some time with you to understand what the strategic objectives are for this project. The best consulting consulting firms are effective at making sure their point of entry is top down. Because if they're going to change culture and process it's the only approach that will work after some period of time, however, if the client has contacted you and you've been unable to establish a different point of entry, you have to respond to the Sprott prospect or you will appear unresponsive. At that point, you have to change your navigation path to bottom up for this opportunity because it's all you can get. But remember that once they become a client you need a process and a plan to move up to top down selling before the second evaluation breaks out. rapport and bonding. The first buying decision an individual prospect makes is about the salesperson and essential process for building preference is obviously establishing a rapport and building bonds. This is where face to face selling personality and chemistry are essential. This is also the subject area of much of the sales literature. Because for a simple sale building bonds with a single buyer is the biggest step in the sale. In fact, Dale Carnegie's initial book How to Win Friends and Influence People was the first approach to making more of a science out of this art. This is still a top selling book and very sound in its advice. building bonds runs the range of iContact handshake uses humor, mutuality learning someone's name, understanding their problems and listening the newer techniques of neuro linguistic programming help salespeople align body language level and speed of voice, familiarity and humor to that of the buyer. Initially, building rapport leads to credibility, which leads to trust. We have to build this bridge quickly and effectively because we can push as much competitive arm across that bridge as the relationship can sustain. And we will only get as much vital competitive and political information in return as the relationship will bear. You must build a bridge of rapport to the point of supporting and a disclosure to where they want to you to win because they think it's best for their organization. Talking about personal competitive issues before you have established rapport is unprofessional and can be catastrophic. You won't be perceived as negative and pushy and you will only receive as much competitive information and information about their buying process. As they trust your solution is best for their organization. It starts from the heart. You is a breach of bonds is not built or breached through insincerity, lack of conviction or poor credibility. It becomes an open drawbridge. You can have the world's greatest product, solution and company but it will all fall into the water you can lose a good message through a bad messenger. By way of a story we had a seller who was selling to the government that had not been successful a couple of years. As it turns out, he just didn't like the people he met there. None of us is good enough character actor to hide that. Selling starts from the heart. If we don't sell them, they won't like us. If we don't like them, they won't like us. And they'll find a million logical reasons to justify buying from someone else. influence the issues. The customer is always right Steve Leonard, the dairy store owner taught us in Tom Peters book thriving kales. But what if the customer is multiple people who don't agree with each other? Who is right is the individual client with the most power or the best business case. In complex solutions made up things they've never bought before the customer may or may not have a clearer picture of what they've done and will rely on vendors and consultants to educate them. Defining requirement is an inexact our salesperson takes a list of requirements as tablets of stone to be met or not he or she underestimates his or her ability to steer the buying criteria. The best time to have done this is while you were delivering the previous piece of business the next best time is during the needs analysis, or the cement store still where a consultative salesperson can suggest capabilities that should be considered. Obviously those things we did well for buying criteria in some cases what the inexperienced prospect wants is not the prospect needs your task is to either educate them reshape their vision of failing that consider whether the client can be successful at all. If they don't consider these issues. If they don't consider the environmental issues of change management and process reengineering trend of the product. You may not want this business under those conditions. Stay the process steer the process the next step is to influence the evaluation process. This means suggesting the client add steps that will highlight your strengths or your competitors weaknesses or take out steps that require lots of resources. Identify the influences. As early and as delicately as possible identify the more powerful influences and what parts people will play in the sales cycle. You must commit resources and win these votes early. These individuals have a higher return on invested time if it's invested early, because they will lead the rest as well as telling you how to win. You will then need a process of political navigation and the skill of strategic literacy, how to get to executives and what to say when you get there. win their hearts before it starts.  By the way, the best way to have won their hearts is in the last sale by having exceeded expectations and by having stayed in touch. But then that's account management if you haven't already done that it's a little like now. Summary - key three building competitive preference.  The first step in controlling an opportunity is establishing the political point of entry. The highest level of preference is trust. build positive mindshare by positioning first with key influence. His positioning is the art of saying it first. Once you establish a channel of communication with executives always leaves a good reason to call back. The ideal point of entry is top down people buy from people establish a bridge of rapport and build bonds. You'll only get as much fire to competitive and political information as the relationship will bear. You can lose a good message to a bad messenger with their hearts before it starts. It is many times easier to help someone make up their mind in the first place and to change it and what you thought was early in the sale probably isn't early enough. Key 4 determining the decision-making process.  The single most important talent in selling professional services is the ability to understand the purchasing process from a time perspective.  Key questions   how do they think they will decide in whose opinion   how do you think they will decide?   What part would each person play   when will they decide   what is the approval process Nothing is more important nothing is more important in driving an accurate strategy that understand the client's decision making process, that information about the decision making process can lead to poor strategy over confidence and defeat. But knowing decision making process can drive the change in strategy to stay in the game and change the issues. In a simple sale with a single buyer, you'd find the pain linked to a solution to it, create preference and then close the complex. However, the decision making process and multiple buyers often becomes convoluted when they can't reach a consensus. This is because project teams typically have a well defined evaluation process, but not a tie breaking decision making process. When they don't all agree. Buy in As the term vote is often thrown about in project teams. This is because one of the reasons for having evaluations is to create participation and therefore buy in. Among project team members who must implement the solution. Participation and buying however, are different from consensus. Top management wants people to feel that they had their say, even if they didn't get their way. When powerstroke was breakout and emotions and politics erupt quite often the bullets are still flying as the project starts there. are winners and losers and indeed quite often saboteurs Algebraic democracy.  What happens in many cases is what has been termed algebraic democracy. Most people involved have a vote of some sort. But some people's vote may count more than others. Some people vote count for X, some can't for 5x There may be some 10x votes, even some companies, there may be one person whose vote outweighs everyone. By the way, this could be unofficial as well. Who's vote camps?  In some situations people get a straw vote. There recommendations taken in but they aren't counted. They are simply qualitative recommendations and the decision makers will take them and pick a vendor knowing this decision making process creates a much different strategy and resource allocation. The significance of these stories is that to the untrained eye that decision making process can seem arbitrary or convoluted, but the more you can understand about the decision-making process upfront the more effective your strategy and resource allocation will be. demystifying the decision-making process  one problem is that the client often doesn't know their own decision-making process. They usually have a well defined information gathering and evaluation process they hope will lead to a consensus. This only happens in Japan where the process takes a very long time as a client reaches the crucible without a consensus politics are up to multi million dollar deals can turn around in a day. You could ask six people inside the organization about decision making process and get eight opinions and all could be wrong. The salesperson must have a greater understanding of how the decision might be reached than even the client does. Since a committee is a group of people, each with a separate set of pains, preferences, power, and each playing different parts. How could one strategy and message for them all as politicians have done for years you need to break the committee down into its component parts and count the votes. You then need to come up with separate strategies and messages for each important participant. You must break your strategy down into more granular tactics at the individual stakeholder level. The more you can understand about decision making process the more effective your strategy and resource allocation will be parts and roles a purchasing polyglot. The paths that each persona plays in a group decision were first identified by Tom Van Oma. The NACA of other authors has added to the vocabulary of selling who are the decision makers approvers. Gatekeepers and influences Miller Heiman identified economic buyers, technical buyers and coaches in the mid 80s. Are there potential influences who can bring in we can bring in on our side are some players non participants for some reason, the stakeholders analysis a stakeholder analysis adds greater definition to these general terms. For example, the term coach in common practice is used to describe someone who's trying to help us win but we have all actually had coaches who killed us people who tried to help us where it actually cost us the business. Why? Because coach, as commonly used is an indicator of preference not power. In some cases, you can have people who like you, but who are so disliked in their own organization, they can actually set you back. When will they decide or will they buy in our lifetime?  The scenario repeated over and over is that of a sales manager on route to an account who asked the salesperson you have it on your forecast that they'll buy by the end of the quarter What Why do you say that? Well, I got the bonus and a trip they have to buy at the end of the quarter the salesman explains. The obvious question is sales managers mind is if you haven't identified the important piece of information as to when they will buy Why are you going into the client with a manager in tow? Well I'll meet you the client sales manager asked Mr. or Miss prospect what bad thing will happen if you don't make a decision by the end of the core. The client stays back within credit Lou witty and says Well nothing I suppose we'll just keep on looking. Publicly owned company companies who need quarterly results try to drive their clients Buying Cycle Timing to the selling cycle of the vendor. In the absence of a true source of urgency too often salespeople resort to price with discounts in order to create urgency. The other thing they do is announce price increases that will kick in the following quarter. Those do not usually succeed either. Not only is this technique predictable, but after months and months of building value for our solution. You've now commodified yourself. You've turned it for value to price in order to close business at the end of the quarter. And once you've offered a discount to close business, you have announced what kind of a vendor you are and the only question now is the price Let the games begin. commodification of opportunities at the end of the quarter drive sales managers crazy can actually signify it significantly impacts shareholder value of companies.  Sources of urgency the foundation of forecast accuracy.  Business that keeps sliding backwards in time and one close usually means that one of two things is missing either the pain is not great enough to cause them to buy now or is that enough political power drive the opportunity to close pain or power is missing. And that should have been detected earlier in the sales cycle. If you had rich pipeline, you might have disqualified this account early. With a thin pipeline you may still pursue it in hopes of creating urgency or gaining access to power. Usually a pain or business problem must be great enough to cause the business to close now or it may not have sought the best paid. Salespeople detect and close on the client's pain or opportunity not their own. forecasts will also be more accurate if we're closing on the client's source of urgency rather than our own. In negotiation power lies in the alternatives. If the client knows that you have a deadline, they have the power. If you know they have a deadline or urgent business problem, you have the power. If you know you are in a winning position going into negotiation. You don't have to give away the store. The source of urgency from a client side may include obsolescence of the current system government regulation seasonality management EDID personal agenda new product rollout new plant being built, project deadline major piece of lost business elections changing technology some of these business problems are more urgent than others as we illustrated with the railroad example cited earlier financial returns a language excite people to buy problems with dates attached to them along with political exposure for making them missing those dates have the highest urgency especially if it means exposure for powerful people regarding powerful people. A consultative salesperson must know how to recognize who has power and how to build influence with them and how to borrow it for access. Okay for power for people on your side earnings. will give you greater leverage as a client organization approaches the decision and will provide greater assurance that a commitment will be made at all. Key 5 sell to power. Every company has two organizational structures performing one is written on the charts. The other one is a living relationships with the men and women in the organization.  Key Questions   are their powerful people helping us   who do we need to be calling on to earn this business   who influences them?   Who else might become involved?   Who is helping our competitors?   We may be equal in the eyes of the Lord of the law but not when it comes to buying decisions of major purchases. Not all votes are equal in a complex. Large organizations are not democracies and some votes are bigger than others. The impact of politics and business decision making has been recognized but business rise since the early 60s And it's been around much longer than that. Often communities can't reach a consensus and don't have a clear process for how to resolve the impasse. If political activity hasn't already been at work, it erupts now. Some people don't like politics and think it's not fair and Politics does have its negative aspects. All you need to do is read the paper each day to see the political tactics being used for personal gain. That's the dark side of power and the negative definition most people give to politics, but politics does have a positive dimension. It is the way people with different points of view resolve their differences without fighting. The US Constitution has stood the test of time for more than 200 years and only broke down into fighting once. political activity and business decisions is there and it's real. You can either ignore it and whine about it or learn to recognize it and manage it. People who don't know what power is, how to recognize it or how to build it and how to use it will be perpetual victims rather than vectors in the complex sale.  The Shadow organization chart  power is invisible. You can see the titles on the door but as Henry Mintzberg described within every organization is an invisible power structure that has little to do with organizational lines. This is sometimes called the back channel. Not only is power invisible, it's dynamic. It changes daily, people gain and lose power on a regular basis. And it's not a universal Halo. It is vectored between individuals we may have power with one person they pay or the mother and negative power with another negative power comes from ethical or performance problems cultural misalignment, or poor people skills. It's hard to believe but there are actually some votes you may not want because if they are for you others will automatically be against you  why do you need to know about power?  You need to know how to identify power and who has it inside your prospects account. Your strategy should then allocate time to those people secure their support early in the process. They will lead others and leverage your time. Secondly, you need to use the same tools to build influence with them and preference for you if you don't have thirdly. Thirdly, if you don't have power, you can borrow it you can borrow it from one person to gain access to or information about another or to have them influence someone else. Fourthly, you need influence to build your own personal network inside your own companies to get things done for the client and inside your own industry to develop your own personal network.  The problem of salesperson faces is that you come into an account. And it's as if you have a freeze frame or snapshot of a motion picture that has been going on for two to five years. You have to figure out quickly who the powerful people are, what the plot is, and what's happened so far so you can project what might happen in the future. From the very first meeting you need to start asking not only needs to process questions, but questions about political power. So you can inventory who has power and discover where to invest your time. The traditional source of power for many years with formal or political or positional authority, which come from someone's title and place in the organization. But as power was studied more closely, and as management teams began to change more attention was paid to personal power or influence. Power Tools sources of influence Influence means getting things done through other people without the use of authority. Stephen Covey in the Seven Habits of Highly Effective People said it well. We build emotional bank accounts with each other. Other business writers have called it social capital. How do people influence others without authority? How do people earn other people's trust in our workshops, clients often come up with more than 50 different sources of influence and power that flows from them. Reciprocity - favors and gratitude. effective sales leaders constantly make deposits and build networks of people inside their organizations and industry who helped them get things done for the client, as well as for themselves. You don't actually keep score but you must make deposits before you can make withdrawals. But some people never seem to figure this out. The everyday give and take of exchanges is known as reciprocity is the currency of social capital. Performance. Not nothing promote success, like success, people who perform tend to build influence. Their ideas get listened to a little bit better. They salespeople point to the numbers and say look at my numbers. This makes my ideas right when the numbers aren't there. Maybe listen to them anymore. Powerful people build on multiple sources of power. Jack Nicklaus was the most competent golfer on the tour early in his career, but many disliked him not only because he was being a charismatic hero, Arnold Palmer, but because check was inelegant and ill in eloquent. That is until Mark McCormack the famous sports manager figure encouraged him to get charisma transplant. common goals common enemy,common goals or common ideology. These are the things that unite different groups into alliances. A contemporary example is or was Netscape, America Online and sun collaborating against the common enemy of Microsoft. ideas and innovations. When you want to think outside the box, there are some people we always want because they are always creative thinkers. These people tend to build influence they know their market price. They know when it's different and why. They developed a group of supporters within the company. They have executive presence a good sense of humor and they always have the best ideas.  Money.   There are benign uses of money for inference. There are dark uses and there are graves. Benign use of money for inference include the biggest donor to a charity. The biggest stockholder, the banker who's toting the note that the biggest customer the dark sources of influence include bribes and kickbacks, unethical, immoral and illegal in some parts of the world, and a way of life and others. The gray areas are perhaps the most insidious political contributions expedite fees for only consulting the rain from hiring consultants and law firms for access to government officials and hiring ex government officials to sell back into their own agencies Leadership Vs salesmanship sometimes power belongs to those who sees it or who take the initiative and get out in front of leading to someone stops them. Social other factors notwithstanding people buy from people they like getting to know someone away from the office helps build those special relationships and can be very useful when the issues turned to business. social influences include activities like tennis and golf clubs, school spouses and friends, professional associations, other executives in the same industry can be extremely influential. Some chairmen are more influential or more influenced by CEOs of other companies. In the industry than by their own vice presidents. Charisma, style presence,  Personality, oratory and persuasiveness are classic sources of influence. There are some people whose presence simply fills the word. Some people are more fun to be around than others and fun is a high level personal value on Maslow’s hierarchy. Integrity, dependability, If influence is social currency then integrity is gold. People can move beyond influence and rapport trust by knowing that you won't do anything to serve yourself at my expense.   Loyalty\n[CATEGORY:  Complex Sale] [SOURCEFILE:  From opportunity management to account management.txt]Chapter 17 from opportunity management to account management key questions  what is our overall plan for this account?  should we invest additional resources?  how do we build company to company trust?  can we change their buying process?  how can we earn preferred vendor status?  can we partner with this account? One of the biggest challenges faced by sales management that's market shaker rose is the transition to the next level of strategy from competitive selling to repetitive selling from opportunity management to account management. Repetitive selling to existing clients is a different world and a different model that requires different strategies talent and rewards. In consulting, information technology, medical equipment, telecommunications, and finance, as well as many other industries, the integration of these two processes is vital to gaining profitable repeat business.  As mentioned previously in some industries the buying decisions are committee evaluations and other industries, such as Consumer Packaged Goods, pharmaceuticals, or industrial supplies, account management means managing A continuous flow of goods or services. To some firms account management means caretaking period to others it means appointing someone to fill out an account profile, list opportunities, and arrange executive lunches period to me it means creating demand, earning executive trust, and achieving A dominant market share within the account. It means ultimately changing the buying process to preferred vendor status or partnership and not having to compete as hard for repeat business.  Investment marketing a project or event type buying, account management is a process of selling between the sales a concept that flies in the face of traditional qualification. There are considerable barriers to investing consistently in accounts that buy only periodically. Quote this, compensation plans, organizational boundaries, project delivery, quarterly focus of publicly traded firms with high stock multiples, market share pressure, and the venture financing of firms with short technology half lives all our obstacles to long term global can't management. Account management should drive opportunity management by influencing preferences, requirements, process, players, and issues before an evaluation break out breaks out but many companies consider them separate processes and fail to realize the enormous benefits of an integrated enterprise plan. What is needed is a client life cycle sales plan that is based on in-depth understanding of the client's business, on driving objectives, and on sharing and communicating tactics to the account team worldwide.  There are eight goals of account management: 1. penetrate 2. demonstrate 3. evaluate 4. radiate 5. collaborate  6. elevate 7. dominate 8.  inoculate   A proactive integrated enterprise care plan requires strategy at 4 levels. After account penetration, performance on the first opportunity is the next hurdle to an account management model for selling repeat business. Failure to exceed expectations or document you delivered can poison the account for future business. However, earning the trust and reducing risk for powerful people can lead to a shorter buying process, referrals, or sponsorship to other executives through the enterprise or industry.  1. Penetrate - penetration of an account occurs through either demand reaction or demand creation. Demand reaction occurs in response to an inquiry or request for proposal turn on creation and new account means gaining access to power sponsor or someone who can take you to one, finding an emotional or political issue, and linking your solution to it. You must then support the efforts of your sponsor to sell your solution inside the organization. The higher your point of entry into the organization the greater your chance of success the entry points used to penetrate an account are also the same that must be constantly defended those entry points are either corporate headquarters, new players, other division, professional association, hot issue and sponsor, integration to other processes and products, business partners, strategic alliance. To inoculate your account from competitive intrusion, you must document value delivered and build preference for your firm, your solution, and yourself at each potential point of entry before the competition can game can gain a toehold. It must be an ongoing, proactive process.  2. Demonstrate - The first hurdle in dominating the account is to demonstrate that you can meet and exceed client expectations for your products solution. Make sure your performance has made your original sponsors look good and having selected you the last time period this means documenting delivered value and proactively claiming the benefits both tangible and intangible your solution has provided. Metrics and key performance indicators other than return on investment are required to measure the many benefits not identified readily by accounting systems for example. 3. Evaluate - Knowing which can't service time and resources in is the challenge to both the sales manager and the individual account manager period two of the most important factors are your own past performance and their culture. If they don't buy from anyone else on the partnership model, their culture towards vendors may be adversarial man wherever the customer may be a large account without being a partnership account. Getting high volumes without lower cost of sales or less competition may be worthwhile, but don't think it's a partnership. They're just high maintenance but worth it. The answer is to sell the way the customer buys, then allocate resources in that way. Thus, some accounts may want a team of dedicated resources and others only occasional calls. Beware that some companies will consume your attention and still treat badly it's in their culture. If you lavish partnership resources on commodity buyers, your partner yourself broke. 4.  - Once a toehold has been established in an account a proactive account strategy requires that you leverage the first engagement to navigate to the next period otherwise you penetrate an account, go back outside, passively wait for the next proposal request, and remained a stranger to the account. Never put the soldiers back in the Trojan horse and go back outside the walls to wait. Having delighted the client sponsors, the next step is to initiate sponsorship from one satisfied executive to another. Every satisfied executive is a neutron that can accelerate you to the next marking molecule to another department, to other divisions, to corporate headquarters, to other companies as sponsors move, or to industry trade organizations all releasing create energy for you. And by moving from one executive to another, you change your navigation from bottom up to top down, a far more efficient approach. Likewise if your performance is bad toxic reputation spreads the same way, but you'll probably never know what didn't hate you. Failure to exceed expectations will mean that in the long run, you are actually performing your sales prevention activity and inoculating the account for further business with you. The greatest internal barriers to radiating are Avengers Internal Revenue recognition and revenue split policies, short term goals and compensation, preference for the thrill of chasing new accounts, and a lack of proactive enterprise account plan and manager.  5. 6 - Collaborate and elevate - you must elevate 2 forces in the account to achieve dominance. We must elevate our value proposition up the value chain from operational commodity to strategically differentiate. We must also elevate our personal relationship from report to trust. Moving to insider status means bringing in industry expertise to help your clients with their clients or constituencies. Collaboration could mean working with their design teams to cope develop new products or mission critical systems specifically for their needs. It could mean working on joint marketing efforts or promotions. It could mean vendor managed inventories for manufacturing, healthcare, or retail. It could mean cooperating on training or quality. It could result in integrating or outsourcing entire supply chain operations into virtual manufacturing parts that ship directly to the customer. As this type of collaboration grows personal risk is lowered and a new source of competitive advantage grows your knowledge of their company and how to get things done in their organization. In some cases, such as enterprise wide solutions, you may be instrumental in implementing massive changes in culture or process. Some of these new solutions are equivalent to betting the life of the company, and you are a consulting physician.  6. Dominate - to dominate does not mean manipulate. It means outperforming expectations and not giving anyone a reason to go to the competition. Delivering superior results and lowering risk creates account inertia the tendency for an account to stay your account. If your goal for an account is to be a preferred vendor or partner, then a new concept arises market share within the account. How much of our type of product or service do they need and what is our current share? What share should be ours? You may be satisfied with what appears to be a large account to you until you measure how much potentially really exists.  7. Inoculate and integrate. Loyalty is a human emotion and account cannot be loyal people in the account can be loyal. That's why true client relationship management at the executive level is between people, not just computers period to develop immunity to competition, you need to develop individual loyalty to your company. Your solutions, and you, personally, to the point that your allies serve as listening posts for competitive incursions or new players. They call you early so you can react to competitive intrusion. How might the competition penetrate your account? From the same places you penetrated in the first place new players, painful issues, integration from other processes and products, professional organisations, other divisions, or strategic alliances from the top period to protect and account, you must proactively identify any potential decision maker for your products services throughout the organization and build preference before the competition does. You must gain access, preferably through a sponsor, and document the value that your firm has delivered as well as your differentiators. New players must be greeted at the door. Positioning, or the art of saying it first, is critical for newcomers. They must be carrying preferences from other firms, in which case you must raise preference for you and document switching costs to at least a point that they choose other battles to fight. In addition, integrating systems, processes, design, training, and intellectual property increases delivered value, and make switching costs higher. As relationships, processes, and cultures grow together, so does interdependence. Gain the high ground an opportunity management and leaders are good thing period in account management, lead is a bad thing. A lead from within an existing account of ours means that a competitive valuation is beginning and we didn't know about it. Market share does not equal customer loyalty. The trust of the powerful people in your account, both high and low in the organization, equals client loyalty. You go for these select accounts is to build such loyalty for your company, its solutions, and for you that the client never has the reason to look elsewhere. You have to influence the politics, issues, competition, and decision making process before an evaluation ever breaks out. It may have to go out to bid but we want the high ground - not based on manipulation but on a trust. Once the formal evaluation process begins, it's too late the walls are up and the guards are out. Even your best clients may not talk to you. It's too late to be their best friend then. When trust is established sales cycles times can fall to zero. The highest level of trust is when the client feels that “whatever you're selling I'm buying tell me what I need”. The irony is that if account management is done well enough you don't have to do opportunity management at all. Abandoning adversarial or computer dependent relationships and solving business problems collaboratives and more productive buyer seller relationship for those firms that sincerely practice it. If we can solve big problems build company to company trust we can achieve the following benefits:  demand creation   executive access   inside consultative status   less price sensitivity   first right to refusal   interdependency  the buyer benefits from lower risk, fewer, greater leverage, and vendors who know how to solve problems in their company and who have the skin in the game of future business. Although lower level personal partnerships bound in commerce and affect face to face selling, only executives with organizational power have the self security and clout to deliver on the promise of shortening sales cycles for departments, divisions, or enterprises. Despite the complexity of selling today's solutions, the secret is simple. It's about building relationships with the right people. Knowing their pain. Solving their problem period earning their trust. It is said that relationships are based on three foundations logos pathos and ethos. Competence charisma and character. It's what you do who you are and who you know. In complex sales:  people buy from people - people with solutions  partners buy from people that they like and that they trust  to be trusted you must be trustworthy  are you that company and are you that person"
    },
    {
        "tool_call_id": "call_WAI1OOBr377Wz3ZRr2OKmf2A",
        "output": "[CATEGORY:  Northhighland] [SOURCEFILE:  northhighland.txt]in the 2017 draft, the team’s incumbent starting quarterback, Alex Smith, was told he would be the starter for the season as Mahomes learned what it meant to be a professional football player. Mahomes sat behind Smith that year and was strategically surrounded by Pro Bowl-caliber skill players. Head coach Andy Reid even adjusted his offense to include more of the concepts Mahomes thrived with at Texas Tech.</p><p>Heading into the 2022 football season Mahomes <a href=\"https://www.espn.com/nfl/story/_/id/34459811/nfl-rank-2022-predicting-top-100-players-stats-notes-quotes-league-best-including-patrick-mahomes-no-1\">was&nbsp;named</a> the league’s best player by a panel of more than 50 NFL experts after throwing for 4,839 yards and 37 touchdowns in 2021. Facing the abysmal fizzle rate of first-season QBs, the Chiefs’ flexible, capability-building operating model was a game changer.</p><p>Much like Mahomes and Smith, you need the right program and project managers, change managers, business analysts, and process engineers to set the tone, call the shots, and drive your business transformation strategy forward. These individuals are the force multipliers of effort, innovation, and growth team-wide. And they can be strategically sourced and developed for optimal output with a Managed Services approach. With access to a diverse blend of cross-discipline expertise, we help public sector transportation organizations accelerate value creation and build the capability to fulfill strategic initiatives in the long term.​</p><p><strong>The coach: </strong>Adaptive workforce management isn’t modus operandi in the public sector. Capability-building must occur through both top-down and bottom-up engagement in order to access its full value potential. It requires leaders and coaches to move from a reactive stance—“I need 10 scrum masters by Friday!”—to looking three to six months ahead with a flexible plan designed to deliver the greatest value and outcomes. It needs a completely new operating model, one that promotes growth, culture, retention, and productivity.</p><blockquote><p>“One thing you have to keep in mind working for [Chiefs] Coach Reid is to remain flexible. Just because we know things a certain way, they aren’t etched in stone around here. It’s also about being creative and forward-thinking. We want to stay two steps ahead.” - Eric Bieniemy, the Chiefs’ offensive coordinator, to the <a href=\"https://www.startribune.com/chiefs-coach-andy-reid-s-beautiful-mind-is-always-searching-for-the-next-imaginative-play/567408652/\">Star Tribune</a>, Jan. 30, 2022</p></blockquote><p>The North Highland service delivery manager and their team of capacity- and capability-building experts establish that new operating model through a framework that keeps day-to-day work aligned with strategic objectives through:</p><ul>\t<li><em><strong>Proactive demand planning:</strong></em> Effective resource pipelines are proactively designed to meet the value and strategic objectives for not just today’s project, but for those in the future, too.</li>\t<li><em><strong>Practitioner recruiting: </strong></em>Recruiting cannot happen in a bubble. Our Managed Services engagements make recruiting a strategic piece of your long-term demand planning, sourcing, and assessing candidates based on current and future-state needs.</li>\t<li><em><strong>Onboarding:</strong></em> Onboarding is important, but it’s also costly and time-consuming. Managed Services unlocks efficiencies and frees your talent to higher-level tasks by incorporating onboarding into a cohesive operating model that perpetuates high performance and cost savings. And perhaps even more critical than efficiency is culture transfer. Our Managed Services team authentically centers onboarding activities around our client's organizational culture, processes, and key stakeholders, imprinting new hires with the cultural modes and methods to deliver value immediately.</li>\t<li><em><strong>Performance, Quality, and Value Management: </strong></em>Transportation leaders cannot transform at the rate of societal need and legislative inquiry without a robust performance, quality, and value management model. Yet just <a href=\"https://www.northhighland.com/insights/blogs/the-next-vantage-for-transportation\">15 percent</a> of transportation leaders told North Highland they were using analytics as a technique in transformation delivery. This low adoption rate may be the fault of inadequate data capabilities, which 44 percent of leaders cite as a barrier to successful transformation delivery. A Managed Services engagement establishes “Moneyball”-esque assessments for precise course correction and long-range direction-setting.</li>\t<li><em><strong>Knowledge Management:</strong></em> Our Managed Services engagements establish the framework for capturing, storing, sharing, and managing the knowledge and experience of employees to increase the overall organizational IQ and prevent it from walking out the door.</li></ul><p><strong>The team: </strong>Mahomes needed a blueprint and a mentor to reach his full potential in the NFL. Smith provided both.</p><p>Managed Services engagements establish a Smith-like team of experts, pre-built and carefully constructed to achieve immediate efficiencies and long-term skill growth.</p><p>Say you need to propel innovation and improve alignment on a large system implementation. Traditional workforce models would plug in an outsourced team of agile workers to accomplish the project at hand. A Managed Services approach generates greater value with a co-sourced approach: Our teams tackle the project at hand and embed agile capabilities for the future. It’s an approach that targets short- and long-term gains, all while avoiding the high, fixed costs and risks associated with hiring full-time employees.</p><p>In large transformation projects, a fixed set of employees is a risk in and of itself. The resources you need now are not what you’ll need in 12 months. Our Managed Services engagements can scale team resources quickly to best support the current demands of your transformation efforts, all while preparing your talent for what lies ahead.</p><p>When considering how Managed Services plays in the team space, adoption is a critical differentiator. What if Smith chose not to help Mahomes, or even worse, to sabotage his success? Smith got on board, adopted the organizational change, and supported its implementation. But what if he hadn’t? In large-scale transformation projects, all the money and experts in the world can’t ensure your team’s adoption of said change once the project is complete. We turn your transformations into a cultural growth driver, creating active supporters—at the leadership and team levels—who are invested in and motivated to support the change. &nbsp;</p><p><strong>From inputs to outcomes: The Managed Services differentiator </strong></p><p>Managed Services provides a blueprint for adaptive workforce management that works for public transportation organizations. We evolve and innovate alongside you, establishing value above and beyond traditional outsourcing models. It’s a co-sourced approach that strategically matches expert coaching and team resources to establish and develop your own winning program.</p></div></div></div></div></div></section><section class=\"block block-layout-builder block-field-blocknodeinsight-detailfield-insight-ct-author block- clearfix\" id=\"block-id-\"><div class=\"erd-list--full-card field field--name-field-insight-ct-author field--type-entity-reference field--label-hidden container employee-list-carousel-container field--items\"><div class=\"employee-list-carousel\"><div class=\"employee__modal_link\" tabindex=\"0\" data-toggle=\"modal\" data-target=\"#employee_card_modal_10031\" role=\"button\"><div class=\"field--item paragraph\"></div><div class=\"hidden\"><div class=\"employee__image\"><img src alt></div><div class=\"employee__bio_details\"></div><div class=\"employee__link\"></div></div></div><div class=\"employee__modal_link\" tabindex=\"0\" data-toggle=\"modal\" data-target=\"#employee_card_modal_10031\" role=\"button\"><div class=\"field--item paragraph\"></div><div class=\"hidden\"><div class=\"employee__image\"><img src alt></div><div class=\"employee__bio_details\"></div><div class=\"employee__link\"></div></div></div><div class=\"employee__modal_link\" tabindex=\"0\" data-toggle=\"modal\" data-target=\"#employee_card_modal_10031\" role=\"button\"><div class=\"field--item paragraph\"></div><div class=\"hidden\"><div class=\"employee__image\"><img src alt></div><div class=\"employee__bio_details\"></div><div class=\"employee__link\"></div></div></div><div class=\"employee__modal_link\" tabindex=\"0\" data-toggle=\"modal\" data-target=\"#employee_card_modal_10031\" role=\"button\"><div class=\"field--item paragraph\"></div><div class=\"hidden\"><div class=\"employee__image\"><img src alt></div><div class=\"employee__bio_details\"></div><div class=\"employee__link\"></div></div></div></div><div class=\"employee-list-carousel-controls \"><button class=\"slick-prev\">Previous</button><div class=\"slick-carousel-dots\"></div><button class=\"slick-next\">Next</button></div><!-- The modal --><div class=\"modal employee__modal\" id=\"employee_card_modal_10031\" tabindex=\"-1\" role=\"dialog\" aria-labelledby=\"modalLabelLarge\" aria-hidden=\"true\"><div class=\"modal-dialog modal-xl\"><button type=\"button\" class=\"close\" data-dismiss=\"modal\" aria-label=\"Close\"><span aria-hidden=\"true\">×</span></button><div class=\"modal-content\"><div class=\"modal-body\"><div class=\"employee-outer-wrapper\"><div class=\"employee-outer spacing__bottom\"><div class=\"employee\"><div class=\"employee__image\"></div><div class=\"employee__details\"><div class=\"employee__name\"></div><div class=\"employee__external\"></div><div class=\"employee__role\"></div></div></div><div class=\"employee__social employee__social__mobile employee__link employee__link__desktop\"></div></div><div class=\"employee_bio_wrapper\"></div></div><div class=\"employee__social employee__social__mobile employee__link employee__link__mobile\"></div></div></div></div></div></div></section><section class=\"block block-layout-builder block-field-blocknodeinsight-detailfield-insight-ct-insights-cat block- clearfix\" id=\"block-id-\"><div class=\"field field--name-field-insight-ct-insights-cat field--type-entity-reference field--label-hidden field--item\"><a href=\"https://www.northhighland.com/taxonomy/term/106/feed?f%5B0%5D=insights_lndg_block_category%3A21\" rel=\"nofollow\">Blogs</a></div></section><section class=\"block block-layout-builder block-field-blocknodeinsight-detailfield-insight-ct-service-line block- clearfix\" id=\"block-id-\"><div class=\"field field--name-field-insight-ct-service-line field--type-entity-reference field--label-hidden field--items\"><div class=\"field--item\"><a href=\"https://www.northhighland.com/taxonomy/term/106/feed?f%5B0%5D=insights_lndg_block_service_line%3A46\" rel=\"nofollow\">Transformation Management</a></div><div class=\"field--item\"><a href=\"https://www.northhighland.com/taxonomy/term/106/feed?f%5B0%5D=insights_lndg_block_service_line%3A206\" rel=\"nofollow\">Workforce and Org Optimization</a></div></div></section><section class=\"block block-layout-builder block-field-blocknodeinsight-detailfield-insight-ct-solution block- clearfix\" id=\"block-id-\"><div class=\"field field--name-field-insight-ct-solution field--type-entity-reference field--label-hidden field--items\"><div class=\"field--item\"><a href=\"https://www.northhighland.com/taxonomy/term/106/feed?f%5B0%5D=insights_lndg_block_solution%3A221\" rel=\"nofollow\">Managed Services</a></div></div></section><section class=\"block block-layout-builder block-field-blocknodeinsight-detailfield-insight-ct-industry block- clearfix\" id=\"block-id-\"><div class=\"field field--name-field-insight-ct-industry field--type-entity-reference field--label-hidden field--item\"><a href=\"https://www.northhighland.com/taxonomy/term/106/feed?f%5B0%5D=insights_lndg_block_industry%3A106\" rel=\"nofollow\">Transportation, Hospitality and Leisure</a></div></section><section class=\"block block-layout-builder block-extra-field-blocknodeinsight-detaillinks block- clearfix\" id=\"block-id-\"></section><section class=\"block block-layout-builder block-field-blocknodeinsight-detailfield-insight-ct-display-tags block- clearfix\" id=\"block-id-\"><div class=\"field field--name-field-insight-ct-display-tags field--type-boolean field--label-hidden field--item\">On</div></section><section class=\"block block-layout-builder block-field-blocknodeinsight-detailfield-insight-ct-meta-tags block- clearfix\" id=\"block-id-\"></section><section class=\"block block-layout-builder block-field-blocknodeinsight-detailfield-insight-ct-author-header block- clearfix\" id=\"block-id-\">\t<h2 class=\"section-title\">About the Authors</h2></section></div></div> Wed, 26 Oct 2022 15:25:07 +0000 Lindsay.castleberry@northhighland.com 10031 at https://www.northhighland.com\n[CATEGORY:  Parexel] [SOURCEFILE:  parexel.txt]Solutions Biotech Therapeutic Expertise Insights Participate Sites About Newsroom Academy Careers 中国 日本 Contact Us Main Menu Newsroom Academy Careers 中国 日本 Contact Us Solutions Biotech Therapeutic Expertise Insights Participate Sites About Close Menu Solutions Explore end-to-end solutions throughout development — from portfolio optimization and regulatory strategy, to Phase I-IV clinical trials, market access planning, and more. See solutions WHAT WE DO Portfolio management and asset valuation Early development and innovation Integrated clinical development Approval and access Value substantiation lifecycle management HOW WE DO IT Delivery models Operational excellence Medical affairs Portfolio management and asset valuation Building patient insights into assets, profile and claims Portfolio optimization Asset valuation and indication prioritization Early evidence review Model-based drug development Integrated development strategy and planning Early development and innovation Phase I Clinical Trials Proof of Concept Studies: Phase IB-IIA Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Site Alliance Network and KOL Engagement Protocol Optimization Regulatory Strategy Market Access Strategy and Delivery Biomarker and Genomic Medicine Strategy Clinical Trial Supply & Logistics Medical Communications Integrated clinical development Phase IIB-IV Clinical Trials Real World Evidence Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Protocol-Driven, Customized Site Solution Strategy Regulatory Strategy, Submissions, Compliance, and Outsourcing Market Access Strategy and Delivery Clinical Development Technology Optimization Clinical Trial Supply & Logistics Medical Communications Approval and access Real World Evidence Global Regulatory Submissions and Outsourcing Compliance and Risk Management Market Access Strategy and Delivery Medical Communications Value substantiation lifecycle management Real-World Evidence, Market Access Strategy and Planning Regulatory Compliance, Drug Safety and Pharmacovigilance Lifecycle Optimization Medical Communications FSP delivery models in clinical trials Gain an advantage through FSP Operational excellence Leveraging AI and digital in clinical development Close Menu Biotech Parexel Biotech provides the end-to-end capabilities you’ll need to succeed. We're fast, flexible, and dedicated to impacting patient lives. Learn more Close Menu Therapeutic Expertise Utilize our expertise across therapeutic areas, combining innovative trial designs, leading clinical and regulatory expertise, global reach, and a passion for changing patient lives. See expertise Therapeutic Expertise Neuroscience General medicine Infectious disease & vaccines Inflammation & immunology Oncology Cross-Therapeutic Expertise Cell & gene therapies Pediatrics Rare diseases Close Menu Insights Our experts help you stay at the forefront of the industry - and ahead of change. See insights New Medicines, Novel Insights Advancing precision oncology Advancing rare disease drug development Accelerating development of cell and gene therapies Achieving patient-guided drug development Discussions on Diversity Overview Chapter 1 Bridging the Gap Chapter 2 Beyond the Binary The Regulatory Navigator New FDA draft guidance: Implications for simplifying interchangeability for biosimilars in the US Key implications for nonclinical development: FDA guidance on human gene therapy products incorporating human genome editing Exploring China’s new pilot regulatory program for rare disease drug development Latest Report New Medicines, Novel Insights: Advancing precision oncology Learn more Close Menu Participate Thinking about joining a clinical trial? Learn the drug development process, what it’s like to participate, how to find a trial, and answers to frequently asked questions. Learn more INTERESTED IN PARTICIPATING? Healthy Volunteers Patient Volunteers Patient Advocacy Groups HEAR FROM REAL PATIENTS Patient Stories TRIAL SITES Baltimore Los Angeles London Berlin Close Menu Sites Want to collaborate with us to offer clinical trials at your site? We would welcome the opportunity to discuss. Learn more Close Menu About We are one of the largest CROs in the world, speeding life-changing medicine to market by engaging patients With Heart ™. Learn about who we are, what we do, and what we believe. About Parexel Leadership team Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Meet us at an event Leadership team Board of Directors Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Compliance & Ethics Tax Strategy Privacy Policy Supplier Data Privacy Requirements Terms of Use French Gender Pay Data UK Gender Pay Data UK Modern Slavery Act Statement Data Privacy Framework Supplier Diversity Policy Meet us at an event Close Search What can we help you find today? Home Insights Webinar Clinical Research Sites Have Spoken: How Can Sponsors and CROs Improve the Site Experience? Clinical Research Sites Have Spoken: How Can Sponsors and CROs Improve the Site Experience? By Karen McIntyre, VP, Global Site Alliances, Launch Excellence Parexel recently partnered with The Tufts Center for the Study of Drug Development (CSDD) to conduct in-depth interviews of investigative sites to understand the current challenges they are facing, potential solutions, and measures of success for productive sponsor/CRO/site relationships. This webinar brings together clinical development and site experts from Parexel and Tufts CSDD to discuss the sites’ feedback including the biggest surprises, the greatest opportunities for improvement, and the steps that Parexel is taking to make a difference. Return to Insights Center Related Insights Podcast Enabling Successful Sites, Ep3: Taking the complexity out of oncology clinical trials Jun 28, 2024 Whitepaper Master Protocols from Design to Delivery Sep 30, 2021 Podcast Decentrally Speaking | Episode 2: The Shifting Roles of Pharmaceutical Depots within a Decentralized Trial Environment May 9, 2022 Blog End-to-end risk management: Getting the most from your program Apr 4, 2022 Video Part 2: Practically Speaking: Driving Clinical Transformation Feb 9, 2022 Video Part 1: Practically Speaking: Driving Clinical Transformation Feb 9, 2022 Blog Master Protocol Trials: What Are the Elements of Success? Dec 1, 2021 Video Part 3: Risk-based Quality Management Video (RBQM) Series Nov 11, 2021 Video Part 2: Risk-based Quality Management Video (RBQM) Series Nov 11, 2021 Video Part 1: Risk-based Quality Management (RBQM) Video Series Nov 11, 2021 Blog What COVID Taught Us About Focus, Innovation, and Leadership Sep 24, 2021 Playbook The upward trend of FSP outsourcing Sep 29, 2022 Contact us Meet us at an event Resources My Communication Preferences Invoicing PO Terms and Conditions Regional Websites Japan China Quick Links Participate Sites Careers Newsroom Academy 2520 Meridian Parkway, Durham, NC 27713 +1 919 544 3170 Privacy Policy Terms of Service Modern Slavery Statement Act © 2024. Parexel International (MA) Corporation. All Rights Reserved.\nSolutions Biotech Therapeutic Expertise Insights Participate Sites About Newsroom Academy Careers 中国 日本 Contact Us Main Menu Newsroom Academy Careers 中国 日本 Contact Us Solutions Biotech Therapeutic Expertise Insights Participate Sites About Close Menu Solutions Explore end-to-end solutions throughout development — from portfolio optimization and regulatory strategy, to Phase I-IV clinical trials, market access planning, and more. See solutions WHAT WE DO Portfolio management and asset valuation Early development and innovation Integrated clinical development Approval and access Value substantiation lifecycle management HOW WE DO IT Delivery models Operational excellence Medical affairs Portfolio management and asset valuation Building patient insights into assets, profile and claims Portfolio optimization Asset valuation and indication prioritization Early evidence review Model-based drug development Integrated development strategy and planning Early development and innovation Phase I Clinical Trials Proof of Concept Studies: Phase IB-IIA Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Site Alliance Network and KOL Engagement Protocol Optimization Regulatory Strategy Market Access Strategy and Delivery Biomarker and Genomic Medicine Strategy Clinical Trial Supply & Logistics Medical Communications Integrated clinical development Phase IIB-IV Clinical Trials Real World Evidence Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Protocol-Driven, Customized Site Solution Strategy Regulatory Strategy, Submissions, Compliance, and Outsourcing Market Access Strategy and Delivery Clinical Development Technology Optimization Clinical Trial Supply & Logistics Medical Communications Approval and access Real World Evidence Global Regulatory Submissions and Outsourcing Compliance and Risk Management Market Access Strategy and Delivery Medical Communications Value substantiation lifecycle management Real-World Evidence, Market Access Strategy and Planning Regulatory Compliance, Drug Safety and Pharmacovigilance Lifecycle Optimization Medical Communications FSP delivery models in clinical trials Gain an advantage through FSP Operational excellence Leveraging AI and digital in clinical development Close Menu Biotech Parexel Biotech provides the end-to-end capabilities you’ll need to succeed. We're fast, flexible, and dedicated to impacting patient lives. Learn more Close Menu Therapeutic Expertise Utilize our expertise across therapeutic areas, combining innovative trial designs, leading clinical and regulatory expertise, global reach, and a passion for changing patient lives. See expertise Therapeutic Expertise Neuroscience General medicine Infectious disease & vaccines Inflammation & immunology Oncology Cross-Therapeutic Expertise Cell & gene therapies Pediatrics Rare diseases Close Menu Insights Our experts help you stay at the forefront of the industry - and ahead of change. See insights New Medicines, Novel Insights Advancing precision oncology Advancing rare disease drug development Accelerating development of cell and gene therapies Achieving patient-guided drug development Discussions on Diversity Overview Chapter 1 Bridging the Gap Chapter 2 Beyond the Binary The Regulatory Navigator New FDA draft guidance: Implications for simplifying interchangeability for biosimilars in the US Key implications for nonclinical development: FDA guidance on human gene therapy products incorporating human genome editing Exploring China’s new pilot regulatory program for rare disease drug development Latest Report New Medicines, Novel Insights: Advancing precision oncology Learn more Close Menu Participate Thinking about joining a clinical trial? Learn the drug development process, what it’s like to participate, how to find a trial, and answers to frequently asked questions. Learn more INTERESTED IN PARTICIPATING? Healthy Volunteers Patient Volunteers Patient Advocacy Groups HEAR FROM REAL PATIENTS Patient Stories TRIAL SITES Baltimore Los Angeles London Berlin Close Menu Sites Want to collaborate with us to offer clinical trials at your site? We would welcome the opportunity to discuss. Learn more Close Menu About We are one of the largest CROs in the world, speeding life-changing medicine to market by engaging patients With Heart ™. Learn about who we are, what we do, and what we believe. About Parexel Leadership team Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Meet us at an event Leadership team Board of Directors Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Compliance & Ethics Tax Strategy Privacy Policy Supplier Data Privacy Requirements Terms of Use French Gender Pay Data UK Gender Pay Data UK Modern Slavery Act Statement Data Privacy Framework Supplier Diversity Policy Meet us at an event Close Search What can we help you find today? Home Parexel Insights Insights Shape the future of drug development with insights from industry-leading experts, including clinicians, former regulators, clinical operations specialists, and data scientists. We've examined the most complex challenges in drug development from every angle to generate these multidimensional insights -- so you can make trials more productive, easier to manage, and more accessible to the patients who need them most. Use the filters below to quickly query our Insights library. Blog Regulatory acceptability of AI: Current perspectives Article Parexel principles for artificial intelligence (AI) Podcast CAR-T boxed warnings: What comes next? Blog CAR-T product development: an assessment of FDA’s final guidance for industry Blog Opportunities and strategies for accelerating patient access to treatments for Alzheimer’s disease Article Near-term strategies for biotech drug developers facing shifting healthcare dynamics Blog As more neuroscience drugs are approved, the value proposition takes center stage Blog How sponsors can make it easier for rare disease patients and families to participate in trials Blog CAR-T boxed warnings: regulatory precedents and opportunities Next Page Back to Insights Home Contact us Meet us at an event Resources My Communication Preferences Invoicing PO Terms and Conditions Regional Websites Japan China Quick Links Participate Sites Careers Newsroom Academy 2520 Meridian Parkway, Durham, NC 27713 +1 919 544 3170 Privacy Policy Terms of Service Modern Slavery Statement Act © 2024. Parexel International (MA) Corporation. All Rights Reserved.\nSolutions Biotech Therapeutic Expertise Insights Participate Sites About Newsroom Academy Careers 中国 日本 Contact Us Main Menu Newsroom Academy Careers 中国 日本 Contact Us Solutions Biotech Therapeutic Expertise Insights Participate Sites About Close Menu Solutions Explore end-to-end solutions throughout development — from portfolio optimization and regulatory strategy, to Phase I-IV clinical trials, market access planning, and more. See solutions WHAT WE DO Portfolio management and asset valuation Early development and innovation Integrated clinical development Approval and access Value substantiation lifecycle management HOW WE DO IT Delivery models Operational excellence Medical affairs Portfolio management and asset valuation Building patient insights into assets, profile and claims Portfolio optimization Asset valuation and indication prioritization Early evidence review Model-based drug development Integrated development strategy and planning Early development and innovation Phase I Clinical Trials Proof of Concept Studies: Phase IB-IIA Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Site Alliance Network and KOL Engagement Protocol Optimization Regulatory Strategy Market Access Strategy and Delivery Biomarker and Genomic Medicine Strategy Clinical Trial Supply & Logistics Medical Communications Integrated clinical development Phase IIB-IV Clinical Trials Real World Evidence Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Protocol-Driven, Customized Site Solution Strategy Regulatory Strategy, Submissions, Compliance, and Outsourcing Market Access Strategy and Delivery Clinical Development Technology Optimization Clinical Trial Supply & Logistics Medical Communications Approval and access Real World Evidence Global Regulatory Submissions and Outsourcing Compliance and Risk Management Market Access Strategy and Delivery Medical Communications Value substantiation lifecycle management Real-World Evidence, Market Access Strategy and Planning Regulatory Compliance, Drug Safety and Pharmacovigilance Lifecycle Optimization Medical Communications FSP delivery models in clinical trials Gain an advantage through FSP Operational excellence Leveraging AI and digital in clinical development Close Menu Biotech Parexel Biotech provides the end-to-end capabilities you’ll need to succeed. We're fast, flexible, and dedicated to impacting patient lives. Learn more Close Menu Therapeutic Expertise Utilize our expertise across therapeutic areas, combining innovative trial designs, leading clinical and regulatory expertise, global reach, and a passion for changing patient lives. See expertise Therapeutic Expertise Neuroscience General medicine Infectious disease & vaccines Inflammation & immunology Oncology Cross-Therapeutic Expertise Cell & gene therapies Pediatrics Rare diseases Close Menu Insights Our experts help you stay at the forefront of the industry - and ahead of change. See insights New Medicines, Novel Insights Advancing precision oncology Advancing rare disease drug development Accelerating development of cell and gene therapies Achieving patient-guided drug development Discussions on Diversity Overview Chapter 1 Bridging the Gap Chapter 2 Beyond the Binary The Regulatory Navigator New FDA draft guidance: Implications for simplifying interchangeability for biosimilars in the US Key implications for nonclinical development: FDA guidance on human gene therapy products incorporating human genome editing Exploring China’s new pilot regulatory program for rare disease drug development Latest Report New Medicines, Novel Insights: Advancing precision oncology Learn more Close Menu Participate Thinking about joining a clinical trial? Learn the drug development process, what it’s like to participate, how to find a trial, and answers to frequently asked questions. Learn more INTERESTED IN PARTICIPATING? Healthy Volunteers Patient Volunteers Patient Advocacy Groups HEAR FROM REAL PATIENTS Patient Stories TRIAL SITES Baltimore Los Angeles London Berlin Close Menu Sites Want to collaborate with us to offer clinical trials at your site? We would welcome the opportunity to discuss. Learn more Close Menu About We are one of the largest CROs in the world, speeding life-changing medicine to market by engaging patients With Heart ™. Learn about who we are, what we do, and what we believe. About Parexel Leadership team Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Meet us at an event Leadership team Board of Directors Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Compliance & Ethics Tax Strategy Privacy Policy Supplier Data Privacy Requirements Terms of Use French Gender Pay Data UK Gender Pay Data UK Modern Slavery Act Statement Data Privacy Framework Supplier Diversity Policy Meet us at an event Close Search What can we help you find today? Home Parexel Insights Insights Shape the future of drug development with insights from industry-leading experts, including clinicians, former regulators, clinical operations specialists, and data scientists. We've examined the most complex challenges in drug development from every angle to generate these multidimensional insights -- so you can make trials more productive, easier to manage, and more accessible to the patients who need them most. Use the filters below to quickly query our Insights library. Blog CAR-T boxed warnings: regulatory precedents and opportunities Playbook What emerging trends in the FDA’s most coveted designations might tell us Blog Reducing technology burdens: How sponsors and CROs can empower sites Blog How we can bring gene therapies to bear on diseases of aging Blog Using ethical AI to streamline HEOR Video Insights with Goldman Sachs Part 6: Generating investor interest Video Insights with Goldman Sachs Part 5: Pioneering new approaches, technologies, and AI to drive innovation Video Insights with Goldman Sachs Part 4: The impact of the Inflation Reduction Act Video Insights with Goldman Sachs Part 3: Regulatory dynamics and research trends Next Page Back to Insights Home Contact us Meet us at an event Resources My Communication Preferences Invoicing PO Terms and Conditions Regional Websites Japan China Quick Links Participate Sites Careers Newsroom Academy 2520 Meridian Parkway, Durham, NC 27713 +1 919 544 3170 Privacy Policy Terms of Service Modern Slavery Statement Act © 2024. Parexel International (MA) Corporation. All Rights Reserved.\nSolutions Biotech Therapeutic Expertise Insights Participate Sites About Newsroom Academy Careers 中国 日本 Contact Us Main Menu Newsroom Academy Careers 中国 日本 Contact Us Solutions Biotech Therapeutic Expertise Insights Participate Sites About Close Menu Solutions Explore end-to-end solutions throughout development — from portfolio optimization and regulatory strategy, to Phase I-IV clinical trials, market access planning, and more. See solutions WHAT WE DO Portfolio management and asset valuation Early development and innovation Integrated clinical development Approval and access Value substantiation lifecycle management HOW WE DO IT Delivery models Operational excellence Medical affairs Portfolio management and asset valuation Building patient insights into assets, profile and claims Portfolio optimization Asset valuation and indication prioritization Early evidence review Model-based drug development Integrated development strategy and planning Early development and innovation Phase I Clinical Trials Proof of Concept Studies: Phase IB-IIA Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Site Alliance Network and KOL Engagement Protocol Optimization Regulatory Strategy Market Access Strategy and Delivery Biomarker and Genomic Medicine Strategy Clinical Trial Supply & Logistics Medical Communications Integrated clinical development Phase IIB-IV Clinical Trials Real World Evidence Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Protocol-Driven, Customized Site Solution Strategy Regulatory Strategy, Submissions, Compliance, and Outsourcing Market Access Strategy and Delivery Clinical Development Technology Optimization Clinical Trial Supply & Logistics Medical Communications Approval and access Real World Evidence Global Regulatory Submissions and Outsourcing Compliance and Risk Management Market Access Strategy and Delivery Medical Communications Value substantiation lifecycle management Real-World Evidence, Market Access Strategy and Planning Regulatory Compliance, Drug Safety and Pharmacovigilance Lifecycle Optimization Medical Communications FSP delivery models in clinical trials Gain an advantage through FSP Operational excellence Leveraging AI and digital in clinical development Close Menu Biotech Parexel Biotech provides the end-to-end capabilities you’ll need to succeed. We're fast, flexible, and dedicated to impacting patient lives. Learn more Close Menu Therapeutic Expertise Utilize our expertise across therapeutic areas, combining innovative trial designs, leading clinical and regulatory expertise, global reach, and a passion for changing patient lives. See expertise Therapeutic Expertise Neuroscience General medicine Infectious disease & vaccines Inflammation & immunology Oncology Cross-Therapeutic Expertise Cell & gene therapies Pediatrics Rare diseases Close Menu Insights Our experts help you stay at the forefront of the industry - and ahead of change. See insights New Medicines, Novel Insights Advancing precision oncology Advancing rare disease drug development Accelerating development of cell and gene therapies Achieving patient-guided drug development Discussions on Diversity Overview Chapter 1 Bridging the Gap Chapter 2 Beyond the Binary The Regulatory Navigator New FDA draft guidance: Implications for simplifying interchangeability for biosimilars in the US Key implications for nonclinical development: FDA guidance on human gene therapy products incorporating human genome editing Exploring China’s new pilot regulatory program for rare disease drug development Latest Report New Medicines, Novel Insights: Advancing precision oncology Learn more Close Menu Participate Thinking about joining a clinical trial? Learn the drug development process, what it’s like to participate, how to find a trial, and answers to frequently asked questions. Learn more INTERESTED IN PARTICIPATING? Healthy Volunteers Patient Volunteers Patient Advocacy Groups HEAR FROM REAL PATIENTS Patient Stories TRIAL SITES Baltimore Los Angeles London Berlin Close Menu Sites Want to collaborate with us to offer clinical trials at your site? We would welcome the opportunity to discuss. Learn more Close Menu About We are one of the largest CROs in the world, speeding life-changing medicine to market by engaging patients With Heart ™. Learn about who we are, what we do, and what we believe. About Parexel Leadership team Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Meet us at an event Leadership team Board of Directors Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Compliance & Ethics Tax Strategy Privacy Policy Supplier Data Privacy Requirements Terms of Use French Gender Pay Data UK Gender Pay Data UK Modern Slavery Act Statement Data Privacy Framework Supplier Diversity Policy Meet us at an event Close Search What can we help you find today? Home Parexel Insights Insights Shape the future of drug development with insights from industry-leading experts, including clinicians, former regulators, clinical operations specialists, and data scientists. We've examined the most complex challenges in drug development from every angle to generate these multidimensional insights -- so you can make trials more productive, easier to manage, and more accessible to the patients who need them most. Use the filters below to quickly query our Insights library. Video Insights with Goldman Sachs Part 3: Regulatory dynamics and research trends Video Insights with Goldman Sachs Part 2: How pharma is using M&A for growth and innovation Video Insights with Goldman Sachs Part 1: Future predictions Article How the new CTIS transparency rules may impact a Sponsor’s document redaction approach Blog Increasing trial participation and population diversity in early-phase Alzheimer’s disease drug development Blog Improving and accelerating clinical research in dementia by integrating the patient’s voice throughout the development journey Blog Regulatory considerations in designing clinical trials for Alzheimer’s disease Blog Building a program for patient-guided clinical research for Alzheimer’s disease Blog New guideline for the management of Systemic Lupus Erythematosus (SLE): Considerations for clinical development Next Page Back to Insights Home Contact us Meet us at an event Resources My Communication Preferences Invoicing PO Terms and Conditions Regional Websites Japan China Quick Links Participate Sites Careers Newsroom Academy 2520 Meridian Parkway, Durham, NC 27713 +1 919 544 3170 Privacy Policy Terms of Service Modern Slavery Statement Act © 2024. Parexel International (MA) Corporation. All Rights Reserved.\nSolutions Biotech Therapeutic Expertise Insights Participate Sites About Newsroom Academy Careers 中国 日本 Contact Us Main Menu Newsroom Academy Careers 中国 日本 Contact Us Solutions Biotech Therapeutic Expertise Insights Participate Sites About Close Menu Solutions Explore end-to-end solutions throughout development — from portfolio optimization and regulatory strategy, to Phase I-IV clinical trials, market access planning, and more. See solutions WHAT WE DO Portfolio management and asset valuation Early development and innovation Integrated clinical development Approval and access Value substantiation lifecycle management HOW WE DO IT Delivery models Operational excellence Medical affairs Portfolio management and asset valuation Building patient insights into assets, profile and claims Portfolio optimization Asset valuation and indication prioritization Early evidence review Model-based drug development Integrated development strategy and planning Early development and innovation Phase I Clinical Trials Proof of Concept Studies: Phase IB-IIA Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Site Alliance Network and KOL Engagement Protocol Optimization Regulatory Strategy Market Access Strategy and Delivery Biomarker and Genomic Medicine Strategy Clinical Trial Supply & Logistics Medical Communications Integrated clinical development Phase IIB-IV Clinical Trials Real World Evidence Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Protocol-Driven, Customized Site Solution Strategy Regulatory Strategy, Submissions, Compliance, and Outsourcing Market Access Strategy and Delivery Clinical Development Technology Optimization Clinical Trial Supply & Logistics Medical Communications Approval and access Real World Evidence Global Regulatory Submissions and Outsourcing Compliance and Risk Management Market Access Strategy and Delivery Medical Communications Value substantiation lifecycle management Real-World Evidence, Market Access Strategy and Planning Regulatory Compliance, Drug Safety and Pharmacovigilance Lifecycle Optimization Medical Communications FSP delivery models in clinical trials Gain an advantage through FSP Operational excellence Leveraging AI and digital in clinical development Close Menu Biotech Parexel Biotech provides the end-to-end capabilities you’ll need to succeed. We're fast, flexible, and dedicated to impacting patient lives. Learn more Close Menu Therapeutic Expertise Utilize our expertise across therapeutic areas, combining innovative trial designs, leading clinical and regulatory expertise, global reach, and a passion for changing patient lives. See expertise Therapeutic Expertise Neuroscience General medicine Infectious disease & vaccines Inflammation & immunology Oncology Cross-Therapeutic Expertise Cell & gene therapies Pediatrics Rare diseases Close Menu Insights Our experts help you stay at the forefront of the industry - and ahead of change. See insights New Medicines, Novel Insights Advancing precision oncology Advancing rare disease drug development Accelerating development of cell and gene therapies Achieving patient-guided drug development Discussions on Diversity Overview Chapter 1 Bridging the Gap Chapter 2 Beyond the Binary The Regulatory Navigator New FDA draft guidance: Implications for simplifying interchangeability for biosimilars in the US Key implications for nonclinical development: FDA guidance on human gene therapy products incorporating human genome editing Exploring China’s new pilot regulatory program for rare disease drug development Latest Report New Medicines, Novel Insights: Advancing precision oncology Learn more Close Menu Participate Thinking about joining a clinical trial? Learn the drug development process, what it’s like to participate, how to find a trial, and answers to frequently asked questions. Learn more INTERESTED IN PARTICIPATING? Healthy Volunteers Patient Volunteers Patient Advocacy Groups HEAR FROM REAL PATIENTS Patient Stories TRIAL SITES Baltimore Los Angeles London Berlin Close Menu Sites Want to collaborate with us to offer clinical trials at your site? We would welcome the opportunity to discuss. Learn more Close Menu About We are one of the largest CROs in the world, speeding life-changing medicine to market by engaging patients With Heart ™. Learn about who we are, what we do, and what we believe. About Parexel Leadership team Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Meet us at an event Leadership team Board of Directors Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Compliance & Ethics Tax Strategy Privacy Policy Supplier Data Privacy Requirements Terms of Use French Gender Pay Data UK Gender Pay Data UK Modern Slavery Act Statement Data Privacy Framework Supplier Diversity Policy Meet us at an event Close Search What can we help you find today? Home Parexel Insights Insights Shape the future of drug development with insights from industry-leading experts, including clinicians, former regulators, clinical operations specialists, and data scientists. We've examined the most complex challenges in drug development from every angle to generate these multidimensional insights -- so you can make trials more productive, easier to manage, and more accessible to the patients who need them most. Use the filters below to quickly query our Insights library. Blog New guideline for the management of Systemic Lupus Erythematosus (SLE): Considerations for clinical development Blog CMC flexibilities in biological medicinal product development: The current EU perspective Blog The EU-CTR transition: Four key ways to prepare now Podcast Preparing for a Cell and Gene Future | Episode 1: Looking Back at 2023 Achievements Webinar EU-CTR: Preparing for trial transition Blog Adoption of the ICH Q12 guideline: New Horizons for Efficient Product Supply Chain Management for a Key Global Market Webinar Breakthrough Devices Program: Where’s the value? Whitepaper Advancing clinical development through innovative trial design Report New Medicines, Novel Insights: Achieving patient-guided drug development Next Page Back to Insights Home Contact us Meet us at an event Resources My Communication Preferences Invoicing PO Terms and Conditions Regional Websites Japan China Quick Links Participate Sites Careers Newsroom Academy 2520 Meridian Parkway, Durham, NC 27713 +1 919 544 3170 Privacy Policy Terms of Service Modern Slavery Statement Act © 2024. Parexel International (MA) Corporation. All Rights Reserved.\n[CATEGORY:  Parexel] [SOURCEFILE:  parexel.txt]Solutions Biotech Therapeutic Expertise Insights Participate Sites About Newsroom Academy Careers 中国 日本 Contact Us Main Menu Newsroom Academy Careers 中国 日本 Contact Us Solutions Biotech Therapeutic Expertise Insights Participate Sites About Close Menu Solutions Explore end-to-end solutions throughout development — from portfolio optimization and regulatory strategy, to Phase I-IV clinical trials, market access planning, and more. See solutions WHAT WE DO Portfolio management and asset valuation Early development and innovation Integrated clinical development Approval and access Value substantiation lifecycle management HOW WE DO IT Delivery models Operational excellence Medical affairs Portfolio management and asset valuation Building patient insights into assets, profile and claims Portfolio optimization Asset valuation and indication prioritization Early evidence review Model-based drug development Integrated development strategy and planning Early development and innovation Phase I Clinical Trials Proof of Concept Studies: Phase IB-IIA Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Site Alliance Network and KOL Engagement Protocol Optimization Regulatory Strategy Market Access Strategy and Delivery Biomarker and Genomic Medicine Strategy Clinical Trial Supply & Logistics Medical Communications Integrated clinical development Phase IIB-IV Clinical Trials Real World Evidence Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Protocol-Driven, Customized Site Solution Strategy Regulatory Strategy, Submissions, Compliance, and Outsourcing Market Access Strategy and Delivery Clinical Development Technology Optimization Clinical Trial Supply & Logistics Medical Communications Approval and access Real World Evidence Global Regulatory Submissions and Outsourcing Compliance and Risk Management Market Access Strategy and Delivery Medical Communications Value substantiation lifecycle management Real-World Evidence, Market Access Strategy and Planning Regulatory Compliance, Drug Safety and Pharmacovigilance Lifecycle Optimization Medical Communications FSP delivery models in clinical trials Gain an advantage through FSP Operational excellence Leveraging AI and digital in clinical development Close Menu Biotech Parexel Biotech provides the end-to-end capabilities you’ll need to succeed. We're fast, flexible, and dedicated to impacting patient lives. Learn more Close Menu Therapeutic Expertise Utilize our expertise across therapeutic areas, combining innovative trial designs, leading clinical and regulatory expertise, global reach, and a passion for changing patient lives. See expertise Therapeutic Expertise Neuroscience General medicine Infectious disease & vaccines Inflammation & immunology Oncology Cross-Therapeutic Expertise Cell & gene therapies Pediatrics Rare diseases Close Menu Insights Our experts help you stay at the forefront of the industry - and ahead of change. See insights New Medicines, Novel Insights Advancing precision oncology Advancing rare disease drug development Accelerating development of cell and gene therapies Achieving patient-guided drug development Discussions on Diversity Overview Chapter 1 Bridging the Gap Chapter 2 Beyond the Binary The Regulatory Navigator New FDA draft guidance: Implications for simplifying interchangeability for biosimilars in the US Key implications for nonclinical development: FDA guidance on human gene therapy products incorporating human genome editing Exploring China’s new pilot regulatory program for rare disease drug development Latest Report New Medicines, Novel Insights: Advancing precision oncology Learn more Close Menu Participate Thinking about joining a clinical trial? Learn the drug development process, what it’s like to participate, how to find a trial, and answers to frequently asked questions. Learn more INTERESTED IN PARTICIPATING? Healthy Volunteers Patient Volunteers Patient Advocacy Groups HEAR FROM REAL PATIENTS Patient Stories TRIAL SITES Baltimore Los Angeles London Berlin Close Menu Sites Want to collaborate with us to offer clinical trials at your site? We would welcome the opportunity to discuss. Learn more Close Menu About We are one of the largest CROs in the world, speeding life-changing medicine to market by engaging patients With Heart ™. Learn about who we are, what we do, and what we believe. About Parexel Leadership team Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Meet us at an event Leadership team Board of Directors Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Compliance & Ethics Tax Strategy Privacy Policy Supplier Data Privacy Requirements Terms of Use French Gender Pay Data UK Gender Pay Data UK Modern Slavery Act Statement Data Privacy Framework Supplier Diversity Policy Meet us at an event Close Search What can we help you find today? Home About Us Harmeet Singh, M.D. BIO Harmeet Singh, M.D. Senior Medical Director, Global TA Head, Nephrology Connect with me Harmeet Singh joined Parexel after approximately 30 years of practicing Nephrology at Western Nephrology P.C., a large single specialty practice based in Denver Metro area. In addition to being a clinician, he served as a Board member, Vice President, and Executive committee leader at Western Nephrology. He was the Medical Director of two freestanding outpatient dialysis centers, Kidney center of Arvada and Davita Arvada dialysis center, for 25 years during which he designed and implemented clinical protocols for management of anemia, hyperparathyroidism, renal bone disease, infection control, home hemodialysis and peritoneal dialysis. He has expertise in clinical nephrology encompassing all areas of adult nephrology including hemodialysis, home hemodialysis, peritoneal dialysis, continuous renal replacement therapy, plasmapheresis, chronic kidney disease, acute kidney injury, nephrolithiasis, hypertension, diabetes, kidney transplant, electrolyte and acid base disorders, hereditary renal disorders amongst others. He has been recognized by peers in the community as a “Top Doc” and is also recognized as a thought leader by peers in the community. In addition, he served on the safety committee of a large metro hospital as a member of peer review committee. He is also a member of Medical Advisory Council of National Forum of ESRD Networks. He was the Medical Director of Clinical Research and Site Principal Investigator at Western Nephrology where he oversaw the clinical research division and has conducted over 35 clinical trials encompassing many areas of nephrology including diabetic and hypertensive chronic kidney disease, hemodialysis, peritoneal dialysis, hypertension, glomerulonephritis, and anemia of kidney disease. He has publications in the areas of IgA nephropathy, and anemia of chronic kidney disease. He has also been a KOL for the industry. Education Harmeet Singh did internal medicine residency training at University of Pittsburgh Medical Center followed by a clinical and research renal fellowship at University of Colorado Health Sciences Center. After finishing fellowship training, he was on the faculty at University of Arkansas for Medical Sciences, Little Rock, AR, prior to joining Western Nephrology. Contact us Meet us at an event Resources My Communication Preferences Invoicing PO Terms and Conditions Regional Websites Japan China Quick Links Participate Sites Careers Newsroom Academy 2520 Meridian Parkway, Durham, NC 27713 +1 919 544 3170 Privacy Policy Terms of Service Modern Slavery Statement Act © 2024. Parexel International (MA) Corporation. All Rights Reserved.\nSolutions Biotech Therapeutic Expertise Insights Participate Sites About Newsroom Academy Careers 中国 日本 Contact Us Main Menu Newsroom Academy Careers 中国 日本 Contact Us Solutions Biotech Therapeutic Expertise Insights Participate Sites About Close Menu Solutions Explore end-to-end solutions throughout development — from portfolio optimization and regulatory strategy, to Phase I-IV clinical trials, market access planning, and more. See solutions WHAT WE DO Portfolio management and asset valuation Early development and innovation Integrated clinical development Approval and access Value substantiation lifecycle management HOW WE DO IT Delivery models Operational excellence Medical affairs Portfolio management and asset valuation Building patient insights into assets, profile and claims Portfolio optimization Asset valuation and indication prioritization Early evidence review Model-based drug development Integrated development strategy and planning Early development and innovation Phase I Clinical Trials Proof of Concept Studies: Phase IB-IIA Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Site Alliance Network and KOL Engagement Protocol Optimization Regulatory Strategy Market Access Strategy and Delivery Biomarker and Genomic Medicine Strategy Clinical Trial Supply & Logistics Medical Communications Integrated clinical development Phase IIB-IV Clinical Trials Real World Evidence Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Protocol-Driven, Customized Site Solution Strategy Regulatory Strategy, Submissions, Compliance, and Outsourcing Market Access Strategy and Delivery Clinical Development Technology Optimization Clinical Trial Supply & Logistics Medical Communications Approval and access Real World Evidence Global Regulatory Submissions and Outsourcing Compliance and Risk Management Market Access Strategy and Delivery Medical Communications Value substantiation lifecycle management Real-World Evidence, Market Access Strategy and Planning Regulatory Compliance, Drug Safety and Pharmacovigilance Lifecycle Optimization Medical Communications FSP delivery models in clinical trials Gain an advantage through FSP Operational excellence Leveraging AI and digital in clinical development Close Menu Biotech Parexel Biotech provides the end-to-end capabilities you’ll need to succeed. We're fast, flexible, and dedicated to impacting patient lives. Learn more Close Menu Therapeutic Expertise Utilize our expertise across therapeutic areas, combining innovative trial designs, leading clinical and regulatory expertise, global reach, and a passion for changing patient lives. See expertise Therapeutic Expertise Neuroscience General medicine Infectious disease & vaccines Inflammation & immunology Oncology Cross-Therapeutic Expertise Cell & gene therapies Pediatrics Rare diseases Close Menu Insights Our experts help you stay at the forefront of the industry - and ahead of change. See insights New Medicines, Novel Insights Advancing precision oncology Advancing rare disease drug development Accelerating development of cell and gene therapies Achieving patient-guided drug development Discussions on Diversity Overview Chapter 1 Bridging the Gap Chapter 2 Beyond the Binary The Regulatory Navigator New FDA draft guidance: Implications for simplifying interchangeability for biosimilars in the US Key implications for nonclinical development: FDA guidance on human gene therapy products incorporating human genome editing Exploring China’s new pilot regulatory program for rare disease drug development Latest Report New Medicines, Novel Insights: Advancing precision oncology Learn more Close Menu Participate Thinking about joining a clinical trial? Learn the drug development process, what it’s like to participate, how to find a trial, and answers to frequently asked questions. Learn more INTERESTED IN PARTICIPATING? Healthy Volunteers Patient Volunteers Patient Advocacy Groups HEAR FROM REAL PATIENTS Patient Stories TRIAL SITES Baltimore Los Angeles London Berlin Close Menu Sites Want to collaborate with us to offer clinical trials at your site? We would welcome the opportunity to discuss. Learn more Close Menu About We are one of the largest CROs in the world, speeding life-changing medicine to market by engaging patients With Heart ™. Learn about who we are, what we do, and what we believe. About Parexel Leadership team Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Meet us at an event Leadership team Board of Directors Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Compliance & Ethics Tax Strategy Privacy Policy Supplier Data Privacy Requirements Terms of Use French Gender Pay Data UK Gender Pay Data UK Modern Slavery Act Statement Data Privacy Framework Supplier Diversity Policy Meet us at an event Close Search What can we help you find today? Home About Us Lazar Mandinov, M.D., Ph.D. BIO Lazar Mandinov, M.D., Ph.D. Global TA Section Head, Cardiovascular Connect with me Lazar joined Parexel International Corporation in April 2014 and has more than 16 years of experience in the biotech and medical device industries. He is an expert in clinical development (Phase I-IV trials), medical affairs, safety, and clinical/regulatory affairs, including multiple interactions with FDA, notified bodies in Europe, and other regulatory agencies. His responsibilities include providing scientific and strategic guidance to customers and internal project groups with an emphasis on medical issues, medical monitoring, consulting in clinical drug development from pre-clinical through post marketing, support for protocol development, regulatory submissions and manuscript development, therapeutic area training, evaluation of new technologies and safety monitoring. Work experience Lazar has extensive expertise in coronary and structural heart interventions, heart failure, heart transplantation, hypertension, angiogenesis, coronary restenosis and stent thrombosis, cell biology, inflammation, and animal disease models. He is board-certified in internal medicine and cardiology. Lazar previously served as chief medical officer and vice president clinical at Mitralign in Tewksbury, MA, and medical director at Boston Scientific in Natick, MA. Prior to that, he spent two years at the Maine Medical Research Institute in Scarborough, ME where he headed several research projects involving the development of novel therapies for coronary restenosis and atherosclerosis. Lazar worked as an interventional cardiologist at the National Center for Cardiovascular Disease in Sofia for two years, when he was also assistant professor of cardiology, and the University Hospital Zurich and the University Hospital Bern, Switzerland for six years. Lazar has published more than 100 manuscripts, book chapters, and abstracts and was a recipient of research grants, and a winner of international and national awards. Education Lazar completed his internal medicine training at the Medical University in Sofia, Bulgaria at the same time when he was attending the M.D., Ph.D. program. Lazar completed cardiology fellowship training at National Center for Cardiovascular Disease in Sofia, Bulgaria with a concentration in interventional cardiology. Contact us Meet us at an event Resources My Communication Preferences Invoicing PO Terms and Conditions Regional Websites Japan China Quick Links Participate Sites Careers Newsroom Academy 2520 Meridian Parkway, Durham, NC 27713 +1 919 544 3170 Privacy Policy Terms of Service Modern Slavery Statement Act © 2024. Parexel International (MA) Corporation. All Rights Reserved.\nSolutions Biotech Therapeutic Expertise Insights Participate Sites About Newsroom Academy Careers 中国 日本 Contact Us Main Menu Newsroom Academy Careers 中国 日本 Contact Us Solutions Biotech Therapeutic Expertise Insights Participate Sites About Close Menu Solutions Explore end-to-end solutions throughout development — from portfolio optimization and regulatory strategy, to Phase I-IV clinical trials, market access planning, and more. See solutions WHAT WE DO Portfolio management and asset valuation Early development and innovation Integrated clinical development Approval and access Value substantiation lifecycle management HOW WE DO IT Delivery models Operational excellence Medical affairs Portfolio management and asset valuation Building patient insights into assets, profile and claims Portfolio optimization Asset valuation and indication prioritization Early evidence review Model-based drug development Integrated development strategy and planning Early development and innovation Phase I Clinical Trials Proof of Concept Studies: Phase IB-IIA Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Site Alliance Network and KOL Engagement Protocol Optimization Regulatory Strategy Market Access Strategy and Delivery Biomarker and Genomic Medicine Strategy Clinical Trial Supply & Logistics Medical Communications Integrated clinical development Phase IIB-IV Clinical Trials Real World Evidence Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Protocol-Driven, Customized Site Solution Strategy Regulatory Strategy, Submissions, Compliance, and Outsourcing Market Access Strategy and Delivery Clinical Development Technology Optimization Clinical Trial Supply & Logistics Medical Communications Approval and access Real World Evidence Global Regulatory Submissions and Outsourcing Compliance and Risk Management Market Access Strategy and Delivery Medical Communications Value substantiation lifecycle management Real-World Evidence, Market Access Strategy and Planning Regulatory Compliance, Drug Safety and Pharmacovigilance Lifecycle Optimization Medical Communications FSP delivery models in clinical trials Gain an advantage through FSP Operational excellence Leveraging AI and digital in clinical development Close Menu Biotech Parexel Biotech provides the end-to-end capabilities you’ll need to succeed. We're fast, flexible, and dedicated to impacting patient lives. Learn more Close Menu Therapeutic Expertise Utilize our expertise across therapeutic areas, combining innovative trial designs, leading clinical and regulatory expertise, global reach, and a passion for changing patient lives. See expertise Therapeutic Expertise Neuroscience General medicine Infectious disease & vaccines Inflammation & immunology Oncology Cross-Therapeutic Expertise Cell & gene therapies Pediatrics Rare diseases Close Menu Insights Our experts help you stay at the forefront of the industry - and ahead of change. See insights New Medicines, Novel Insights Advancing precision oncology Advancing rare disease drug development Accelerating development of cell and gene therapies Achieving patient-guided drug development Discussions on Diversity Overview Chapter 1 Bridging the Gap Chapter 2 Beyond the Binary The Regulatory Navigator New FDA draft guidance: Implications for simplifying interchangeability for biosimilars in the US Key implications for nonclinical development: FDA guidance on human gene therapy products incorporating human genome editing Exploring China’s new pilot regulatory program for rare disease drug development Latest Report New Medicines, Novel Insights: Advancing precision oncology Learn more Close Menu Participate Thinking about joining a clinical trial? Learn the drug development process, what it’s like to participate, how to find a trial, and answers to frequently asked questions. Learn more INTERESTED IN PARTICIPATING? Healthy Volunteers Patient Volunteers Patient Advocacy Groups HEAR FROM REAL PATIENTS Patient Stories TRIAL SITES Baltimore Los Angeles London Berlin Close Menu Sites Want to collaborate with us to offer clinical trials at your site? We would welcome the opportunity to discuss. Learn more Close Menu About We are one of the largest CROs in the world, speeding life-changing medicine to market by engaging patients With Heart ™. Learn about who we are, what we do, and what we believe. About Parexel Leadership team Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Meet us at an event Leadership team Board of Directors Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Compliance & Ethics Tax Strategy Privacy Policy Supplier Data Privacy Requirements Terms of Use French Gender Pay Data UK Gender Pay Data UK Modern Slavery Act Statement Data Privacy Framework Supplier Diversity Policy Meet us at an event Close Search What can we help you find today? Home About Us Roxana Robini BIO Roxana Robini Senior Medical Director, Head, Medical Sciences Connect with me Dr. Roxana Robini, MD is a qualified physician who specializes in Family Medicine and has several years of broad clinical experience gained in Internal Medicine, Pediatrics, Gynecology & Obstetrics as well as General Surgery. Work Experience Industry experience involves various aspects (medical monitoring, drug safety, DM) and phases (II-IV) of clinical drug development, working on more than 40 clinical research projects in various therapeutic areas since 1993 (cardiology, neurology, ophtalmology, psychiatry, HIV), with a focus on oncology and pneumology. Dr. Robini has been with Parexel, a Contract Research Organization for over 15 years. Her clinical trial experience has included all phases (Phases I-IV) of clinical and post-marketing development as well as Expanded Access and Named Patient Programs. With more than ten (10) years as Medical Monitor (MM), Dr. Robini has been responsible for the overall coordination of the medical monitoring activities and safety monitoring tasks delegated to PAREXEL and for providing scientific and technical leadership to the project team. In her role, she is identified as the primary contact by the sites for all questions concerning the medical aspects of the protocol, patients’ eligibility criteria, study drug administration as well as safety issues (review of CRF data, labs, narratives) in close collaboration with the medical officer of the sponsor. Following (5) years as Drug Safety Physician and Pharmacovigilance Manager, Dr. Robini through her extensive exposure to clinical trials management and team-oriented approach, is fully appreciative of GCP standards, adherence to protocol design, the importance of safety monitoring and maintaining the integrity of patient data collected during clinical trials. Dr. Robini currently provides guidance related to the execution of various clinical studies in oncology with a total of 8 trials in indications such as breast, lung, ovarian and renal cancers as well in pneumology trials (COPD-16 000 patients, Bronchiectasis -1000pts). Contact us Meet us at an event Resources My Communication Preferences Invoicing PO Terms and Conditions Regional Websites Japan China Quick Links Participate Sites Careers Newsroom Academy 2520 Meridian Parkway, Durham, NC 27713 +1 919 544 3170 Privacy Policy Terms of Service Modern Slavery Statement Act © 2024. Parexel International (MA) Corporation. All Rights Reserved.\nSolutions Biotech Therapeutic Expertise Insights Participate Sites About Newsroom Academy Careers 中国 日本 Contact Us Main Menu Newsroom Academy Careers 中国 日本 Contact Us Solutions Biotech Therapeutic Expertise Insights Participate Sites About Close Menu Solutions Explore end-to-end solutions throughout development — from portfolio optimization and regulatory strategy, to Phase I-IV clinical trials, market access planning, and more. See solutions WHAT WE DO Portfolio management and asset valuation Early development and innovation Integrated clinical development Approval and access Value substantiation lifecycle management HOW WE DO IT Delivery models Operational excellence Medical affairs Portfolio management and asset valuation Building patient insights into assets, profile and claims Portfolio optimization Asset valuation and indication prioritization Early evidence review Model-based drug development Integrated development strategy and planning Early development and innovation Phase I Clinical Trials Proof of Concept Studies: Phase IB-IIA Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Site Alliance Network and KOL Engagement Protocol Optimization Regulatory Strategy Market Access Strategy and Delivery Biomarker and Genomic Medicine Strategy Clinical Trial Supply & Logistics Medical Communications Integrated clinical development Phase IIB-IV Clinical Trials Real World Evidence Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Protocol-Driven, Customized Site Solution Strategy Regulatory Strategy, Submissions, Compliance, and Outsourcing Market Access Strategy and Delivery Clinical Development Technology Optimization Clinical Trial Supply & Logistics Medical Communications Approval and access Real World Evidence Global Regulatory Submissions and Outsourcing Compliance and Risk Management Market Access Strategy and Delivery Medical Communications Value substantiation lifecycle management Real-World Evidence, Market Access Strategy and Planning Regulatory Compliance, Drug Safety and Pharmacovigilance Lifecycle Optimization Medical Communications FSP delivery models in clinical trials Gain an advantage through FSP Operational excellence Leveraging AI and digital in clinical development Close Menu Biotech Parexel Biotech provides the end-to-end capabilities you’ll need to succeed. We're fast, flexible, and dedicated to impacting patient lives. Learn more Close Menu Therapeutic Expertise Utilize our expertise across therapeutic areas, combining innovative trial designs, leading clinical and regulatory expertise, global reach, and a passion for changing patient lives. See expertise Therapeutic Expertise Neuroscience General medicine Infectious disease & vaccines Inflammation & immunology Oncology Cross-Therapeutic Expertise Cell & gene therapies Pediatrics Rare diseases Close Menu Insights Our experts help you stay at the forefront of the industry - and ahead of change. See insights New Medicines, Novel Insights Advancing precision oncology Advancing rare disease drug development Accelerating development of cell and gene therapies Achieving patient-guided drug development Discussions on Diversity Overview Chapter 1 Bridging the Gap Chapter 2 Beyond the Binary The Regulatory Navigator New FDA draft guidance: Implications for simplifying interchangeability for biosimilars in the US Key implications for nonclinical development: FDA guidance on human gene therapy products incorporating human genome editing Exploring China’s new pilot regulatory program for rare disease drug development Latest Report New Medicines, Novel Insights: Advancing precision oncology Learn more Close Menu Participate Thinking about joining a clinical trial? Learn the drug development process, what it’s like to participate, how to find a trial, and answers to frequently asked questions. Learn more INTERESTED IN PARTICIPATING? Healthy Volunteers Patient Volunteers Patient Advocacy Groups HEAR FROM REAL PATIENTS Patient Stories TRIAL SITES Baltimore Los Angeles London Berlin Close Menu Sites Want to collaborate with us to offer clinical trials at your site? We would welcome the opportunity to discuss. Learn more Close Menu About We are one of the largest CROs in the world, speeding life-changing medicine to market by engaging patients With Heart ™. Learn about who we are, what we do, and what we believe. About Parexel Leadership team Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Meet us at an event Leadership team Board of Directors Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Compliance & Ethics Tax Strategy Privacy Policy Supplier Data Privacy Requirements Terms of Use French Gender Pay Data UK Gender Pay Data UK Modern Slavery Act Statement Data Privacy Framework Supplier Diversity Policy Meet us at an event Close Search What can we help you find today? Home About Us Viviana Reidel, M.D. BIO Viviana Reidel, M.D. Senior Medical Director Connect with me Viviana joined Parexel in 2012 and is a board-certified Endocrinologist and Internist. She has 15+ years of industry experience in medical monitoring on multiple endocrinology and osteoporosis studies, phase II to IV, and 25+ years of clinical experience in adult endocrinology, including osteoporosis, diabetes, and other endocrine disorders. Viviana was a former staff physician at the Bone Metabolic Disease Unit (Durand General Hospital, Buenos Aires, Argentina) and studied medicine at theUniversity of Buenos Aires. Contact us Meet us at an event Resources My Communication Preferences Invoicing PO Terms and Conditions Regional Websites Japan China Quick Links Participate Sites Careers Newsroom Academy 2520 Meridian Parkway, Durham, NC 27713 +1 919 544 3170 Privacy Policy Terms of Service Modern Slavery Statement Act © 2024. Parexel International (MA) Corporation. All Rights Reserved.\nSolutions Biotech Therapeutic Expertise Insights Participate Sites About Newsroom Academy Careers 中国 日本 Contact Us Main Menu Newsroom Academy Careers 中国 日本 Contact Us Solutions Biotech Therapeutic Expertise Insights Participate Sites About Close Menu Solutions Explore end-to-end solutions throughout development — from portfolio optimization and regulatory strategy, to Phase I-IV clinical trials, market access planning, and more. See solutions WHAT WE DO Portfolio management and asset valuation Early development and innovation Integrated clinical development Approval and access Value substantiation lifecycle management HOW WE DO IT Delivery models Operational excellence Medical affairs Portfolio management and asset valuation Building patient insights into assets, profile and claims Portfolio optimization Asset valuation and indication prioritization Early evidence review Model-based drug development Integrated development strategy and planning Early development and innovation Phase I Clinical Trials Proof of Concept Studies: Phase IB-IIA Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Site Alliance Network and KOL Engagement Protocol Optimization Regulatory Strategy Market Access Strategy and Delivery Biomarker and Genomic Medicine Strategy Clinical Trial Supply & Logistics Medical Communications Integrated clinical development Phase IIB-IV Clinical Trials Real World Evidence Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Protocol-Driven, Customized Site Solution Strategy Regulatory Strategy, Submissions, Compliance, and Outsourcing Market Access Strategy and Delivery Clinical Development Technology Optimization Clinical Trial Supply & Logistics Medical Communications Approval and access Real World Evidence Global Regulatory Submissions and Outsourcing Compliance and Risk Management Market Access Strategy and Delivery Medical Communications Value substantiation lifecycle management Real-World Evidence, Market Access Strategy and Planning Regulatory Compliance, Drug Safety and Pharmacovigilance Lifecycle Optimization Medical Communications FSP delivery models in clinical trials Gain an advantage through FSP Operational excellence Leveraging AI and digital in clinical development Close Menu Biotech Parexel Biotech provides the end-to-end capabilities you’ll need to succeed. We're fast, flexible, and dedicated to impacting patient lives. Learn more Close Menu Therapeutic Expertise Utilize our expertise across therapeutic areas, combining innovative trial designs, leading clinical and regulatory expertise, global reach, and a passion for changing patient lives. See expertise Therapeutic Expertise Neuroscience General medicine Infectious disease & vaccines Inflammation & immunology Oncology Cross-Therapeutic Expertise Cell & gene therapies Pediatrics Rare diseases Close Menu Insights Our experts help you stay at the forefront of the industry - and ahead of change. See insights New Medicines, Novel Insights Advancing precision oncology Advancing rare disease drug development Accelerating development of cell and gene therapies Achieving patient-guided drug development Discussions on Diversity Overview Chapter 1 Bridging the Gap Chapter 2 Beyond the Binary The Regulatory Navigator New FDA draft guidance: Implications for simplifying interchangeability for biosimilars in the US Key implications for nonclinical development: FDA guidance on human gene therapy products incorporating human genome editing Exploring China’s new pilot regulatory program for rare disease drug development Latest Report New Medicines, Novel Insights: Advancing precision oncology Learn more Close Menu Participate Thinking about joining a clinical trial? Learn the drug development process, what it’s like to participate, how to find a trial, and answers to frequently asked questions. Learn more INTERESTED IN PARTICIPATING? Healthy Volunteers Patient Volunteers Patient Advocacy Groups HEAR FROM REAL PATIENTS Patient Stories TRIAL SITES Baltimore Los Angeles London Berlin Close Menu Sites Want to collaborate with us to offer clinical trials at your site? We would welcome the opportunity to discuss. Learn more Close Menu About We are one of the largest CROs in the world, speeding life-changing medicine to market by engaging patients With Heart ™. Learn about who we are, what we do, and what we believe. About Parexel Leadership team Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Meet us at an event Leadership team Board of Directors Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Compliance & Ethics Tax Strategy Privacy Policy Supplier Data Privacy Requirements Terms of Use French Gender Pay Data UK Gender Pay Data UK Modern Slavery Act Statement Data Privacy Framework Supplier Diversity Policy Meet us at an event Close Search What can we help you find today? Home About Us Juergen Schaper BIO Juergen Schaper Vice President, Global Medical Sciences Connect with me Dr. Schaper joined Parexel in 1998. Currently Dr. Schaper heads the Medical Services Group Berlin/Central Region, within Worldwide Medical Services at Parexel. Dr. Schaper is widely experienced in the medical monitoring of studies for a variety of indications, including cardiovascular diseases, gastro-intestinal diseases, sepsis and nephrology (uremic pruritus). Work experience Before joining Parexel, Dr. Schaper worked at the German Federal Institute for Drugs and Medical Devices, where he was responsible for medical review of national and European submissions for the authorization of medicinal products for human use, scientific advice on drug development and study design. Education Dr. Schaper earned his medical degree from the Medical Faculty of the University of Hamburg, Germany in 1987. He gained clinical experience in residencies in internal medicine and intensive care. Contact us Meet us at an event Resources My Communication Preferences Invoicing PO Terms and Conditions Regional Websites Japan China Quick Links Participate Sites Careers Newsroom Academy 2520 Meridian Parkway, Durham, NC 27713 +1 919 544 3170 Privacy Policy Terms of Service Modern Slavery Statement Act © 2024. Parexel International (MA) Corporation. All Rights Reserved.\nSolutions Biotech Therapeutic Expertise Insights Participate Sites About Newsroom Academy Careers 中国 日本 Contact Us Main Menu Newsroom Academy Careers 中国 日本 Contact Us Solutions Biotech Therapeutic Expertise Insights Participate Sites About Close Menu Solutions Explore end-to-end solutions throughout development — from portfolio optimization and regulatory strategy, to Phase I-IV clinical trials, market access planning, and more. See solutions WHAT WE DO Portfolio management and asset valuation Early development and innovation Integrated clinical development Approval and access Value substantiation lifecycle management HOW WE DO IT Delivery models Operational excellence Medical affairs Portfolio management and asset valuation Building patient insights into assets, profile and claims Portfolio optimization Asset valuation and indication prioritization Early evidence review Model-based drug development Integrated development strategy and planning Early development and innovation Phase I Clinical Trials Proof of Concept Studies: Phase IB-IIA Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Site Alliance Network and KOL Engagement Protocol Optimization Regulatory Strategy Market Access Strategy and Delivery Biomarker and Genomic Medicine Strategy Clinical Trial Supply & Logistics Medical Communications Integrated clinical development Phase IIB-IV Clinical Trials Real World Evidence Patient Engagement Strategy and Enrollment Solutions Patient Inclusion Protocol-Driven, Customized Site Solution Strategy Regulatory Strategy, Submissions, Compliance, and Outsourcing Market Access Strategy and Delivery Clinical Development Technology Optimization Clinical Trial Supply & Logistics Medical Communications Approval and access Real World Evidence Global Regulatory Submissions and Outsourcing Compliance and Risk Management Market Access Strategy and Delivery Medical Communications Value substantiation lifecycle management Real-World Evidence, Market Access Strategy and Planning Regulatory Compliance, Drug Safety and Pharmacovigilance Lifecycle Optimization Medical Communications FSP delivery models in clinical trials Gain an advantage through FSP Operational excellence Leveraging AI and digital in clinical development Close Menu Biotech Parexel Biotech provides the end-to-end capabilities you’ll need to succeed. We're fast, flexible, and dedicated to impacting patient lives. Learn more Close Menu Therapeutic Expertise Utilize our expertise across therapeutic areas, combining innovative trial designs, leading clinical and regulatory expertise, global reach, and a passion for changing patient lives. See expertise Therapeutic Expertise Neuroscience General medicine Infectious disease & vaccines Inflammation & immunology Oncology Cross-Therapeutic Expertise Cell & gene therapies Pediatrics Rare diseases Close Menu Insights Our experts help you stay at the forefront of the industry - and ahead of change. See insights New Medicines, Novel Insights Advancing precision oncology Advancing rare disease drug development Accelerating development of cell and gene therapies Achieving patient-guided drug development Discussions on Diversity Overview Chapter 1 Bridging the Gap Chapter 2 Beyond the Binary The Regulatory Navigator New FDA draft guidance: Implications for simplifying interchangeability for biosimilars in the US Key implications for nonclinical development: FDA guidance on human gene therapy products incorporating human genome editing Exploring China’s new pilot regulatory program for rare disease drug development Latest Report New Medicines, Novel Insights: Advancing precision oncology Learn more Close Menu Participate Thinking about joining a clinical trial? Learn the drug development process, what it’s like to participate, how to find a trial, and answers to frequently asked questions. Learn more INTERESTED IN PARTICIPATING? Healthy Volunteers Patient Volunteers Patient Advocacy Groups HEAR FROM REAL PATIENTS Patient Stories TRIAL SITES Baltimore Los Angeles London Berlin Close Menu Sites Want to collaborate with us to offer clinical trials at your site? We would welcome the opportunity to discuss. Learn more Close Menu About We are one of the largest CROs in the world, speeding life-changing medicine to market by engaging patients With Heart ™. Learn about who we are, what we do, and what we believe. About Parexel Leadership team Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Meet us at an event Leadership team Board of Directors Global reach Our DE&I strategy Our ESG strategy Compliance, tax & privacy Compliance & Ethics Tax Strategy Privacy Policy Supplier Data Privacy Requirements Terms of Use French Gender Pay Data UK Gender Pay Data UK Modern Slavery Act Statement Data Privacy Framework Supplier Diversity Policy Meet us at an event Close Search What can we help you find today? Home About Us Iakov Lisenko BIO Iakov Lisenko Senior Project Leader Connect with me Iakov has 13 years of experience in clinical research, with four years specifically in project management. His clinical study experience includes Global Phase Ib/II/III studies. Iakov is an M.D. specialized in general medicine and cardiology but has study experience across various therapeutic areas, including neurology, oncology, rheumatology, nephrology, pulmonology, ophthalmology, and pediatric indications. Contact us Meet us at an event Resources My Communication Preferences Invoicing PO Terms and Conditions Regional Websites Japan China Quick Links Participate Sites Careers Newsroom Academy 2520 Meridian Parkway, Durham, NC 27713 +1 919 544 3170 Privacy Policy Terms of Service Modern Slavery Statement Act © 2024. Parexel International (MA) Corporation. All Rights Reserved."
    }
]